{"title":"Game of Thrones - 6ª Temporada (2016)[720p]","uid":15749527,"size":5965129748,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:003ec0c723bf99bdea871e78f59840e4b448c144&amp;dn=Game+of+Thrones+-+6%26ordf%3B+Temporada+%282016%29%5B720p%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":14,"uploader":"gilsonC10","files":21,"time":1473015697,"description":"\n\r\nA sexta temporada de Game of Thrones marca o retorno de Bran Stark, que, após o treinamento com o misterioso Corvo de Três Olhos, pode agora usar seus dons especiais para ver o passado, o presente e o futuro de Westeros.\r\n\r\nCom a queda de Stannis Baratheon, a guerra pelo Trono de Ferro parece ter acabado, mas ainda há ameaças ao reinado do Rei Tommen. Será que a morte da Princesa Myrcella pode provocar uma guerra dos Lannister com Dorne? E o o Alto Pardal e seu crescente exército de fieis pode representar problemas para Porto Real?\r\n\r\nDo outro lado do Mar Estreito, Daenerys Targaryen saiu literalmente voando da cidade de Meereen, deixando Tyrion Lannister para governar em seu lugar. Será que ele pode manter a cidade de pé enquanto Jorah Mormont e Daario Naharis continuam a procurar pela rainha? Enquanto isso, em Bravos, Arya Stark encontra-se cega; mas continuará seu treinamento junto aos Homens Sem Face?\r\n\r\nAo Norte de Westeros, os Boltons permanecem em Winterfell, mas Sansa Stark e Theon Greyjoy conseguiram fugir de seus captores. Com Brienne procurando o verdadeiro herdeiro da Casa Stark, enquanto os vassalos leais da Casa Stark e as forças dos Greyjoys crescem, conseguirão os Boltons manter seus planos de poder?","torrent":{"xt":"urn:btih:003ec0c723bf99bdea871e78f59840e4b448c144","amp;dn":"Game+of+Thrones+-+6%26ordf%3B+Temporada+%282016%29%5B720p%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"003ec0c723bf99bdea871e78f59840e4b448c144","infoHashBuffer":{"type":"Buffer","data":[0,62,192,199,35,191,153,189,234,135,30,120,245,152,64,228,180,72,193,68]},"announce":[],"urlList":[]}}