{"title":"Crosby &amp; Nash - Another Stoney Evening, FLAC (1998)","uid":15463583,"size":407206054,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:07131a2dbb00c2e73026255db174f5533a8a9d40&amp;dn=Crosby+%26amp%3B+Nash+-+Another+Stoney+Evening%2C+FLAC+%281998%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":22,"time":1470073783,"description":"The Crosby-Nash subset of CSNY carried with it much of the charm and harmony of the larger group, and together and apart the two singers mined that appeal for several gold albums, especially in the first couple of years after the breakup of CSNY in 1970. They even inspired bootleggers, who released Another Stoney Evening, drawn from one of their 1971 shows. Hence the title of this belated official release, drawn from a different show at the Dorothy Chandler Pavilion in Los Angeles on October 10. Working with acoustic guitars and piano, they sang some of their more popular CSNY songs (&quot;Déjà Vu,&quot; &quot;Teach Your Children&quot;), as well as tunes from their solo albums and songs that would turn up on their duo album the following year. Boasting of having &quot;the loosest show on earth&quot; and making cryptic drug references, they nevertheless sang and played well, overcoming with enthusiasm and craft the relative weaknesses of some of the material -- Crosby's formlessness, Nash's preciousness. And the camaraderie they shared with each other and their audience even allowed them a certain imperiousness, such as when the drugged performers lectured the drugged audience on how to clap on the right beat","torrent":{"xt":"urn:btih:07131a2dbb00c2e73026255db174f5533a8a9d40","amp;dn":"Crosby+%26amp%3B+Nash+-+Another+Stoney+Evening%2C+FLAC+%281998%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07131a2dbb00c2e73026255db174f5533a8a9d40","infoHashBuffer":{"type":"Buffer","data":[7,19,26,45,187,0,194,231,48,38,37,93,177,116,245,83,58,138,157,64]},"announce":[],"urlList":[]}}