{"title":"Nanoporous Materials II - Abdelhamid Sayari et al.","uid":15471912,"size":45622215,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0870ab4e5ee7410ac38964ccb7f54bf99ea4a581&amp;dn=Nanoporous+Materials+II+-+Abdelhamid+Sayari+et+al.&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clouderone","files":1,"time":1470146316,"description":"Nanoporous Materials II - Abdelhamid Sayari et al. (Elsevier, 2000).pdf\r\n\r\nThe first symposium on Access in Nanoporous Materials was held in Lansing, Michigan on June 7-9, 1995. The five years that have passed since that initial meeting have brought remarkable advances in all aspects of this growing family of materials. In particular, impressive progress has been achieved in the area of novel self-assembled mesoporous materials, their synthesis, characterization and applications. The supramolecular self-assembly of various inorganic and organic species into ordered mesostructures became a powerful method for synthesis of mesoporous molecular sieves of tailored framework composition, pore structure, pore size and desired surface functionality for advanced applications in such areas as separation, adsorption, catalysis, environmental cleanup and nanotechnology.\r\nIn addition to mesostructured metal oxide molecular sieves prepared through supramolecular assembly pathways, clays, carbon molecular sieves, porous polymers, sol-gel and imprinted materials, as well as self-assembled organic and other zeolite-like materials, have captured the attention of materials researchers around the globe.\r\n\r\nThe contents of the current volume present a sampling of more than 150 oral and poster papers delivered at the Symposium on Access in Nanoporous Materials II held in Banff, Alberta on May 25-30, 2000. About 70% of the papers are devoted to the synthesis of siliceous mesoporous molecular sieves, their modification, characterization and applications, which represent the current research trend in nanoporous materials. The remaining contributions provide some indications on the future developments in the area of non-siliceous molecular sieves and related materials. This book reflects the current trends and advances in this area, which will certainly attract the attention of materials chemists in the 21st century","torrent":{"xt":"urn:btih:0870ab4e5ee7410ac38964ccb7f54bf99ea4a581","amp;dn":"Nanoporous+Materials+II+-+Abdelhamid+Sayari+et+al.","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0870ab4e5ee7410ac38964ccb7f54bf99ea4a581","infoHashBuffer":{"type":"Buffer","data":[8,112,171,78,94,231,65,10,195,137,100,204,183,245,75,249,158,164,165,129]},"announce":[],"urlList":[]}}