{"title":"King of the Hill Complete Series","uid":15261047,"size":39866540462,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0b1a4cd998d0da369ed1caed2947179b9af929fb&amp;dn=King+of+the+Hill+Complete+Series&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":259,"time":1468181316,"description":"King of the Hill is an American adult animated series created by Mike Judge and Greg Daniels that ran from January 12, 1997, to May 6, 2010 on Fox. It centers on the Hills, a middle-class American family in the fictional small town of Arlen, Texas. It attempts to retain a realistic approach, seeking humor in the conventional and mundane aspects of everyday life.\r\n\r\nJudge and Daniels conceived the series after a run with Judge's Beavis and Butt-head on MTV, and the series debuted on the Fox network as a mid-season replacement on January 12, 1997, quickly becoming a hit. The series' popularity led to worldwide syndication, and reruns aired nightly on Adult Swim. The show became one of Fox's longest-running series (third-longest as an animated series, after Family Guy and The Simpsons), and briefly held the record for the second longest running animated sitcom in history. In 2007, it was named by Time magazine as one of the top 100 greatest television shows of all time. The title theme was written and performed by The Refreshments. King of the Hill won two Emmy Awards and was nominated for seven.\r\n\r\nThe series had a total of 259 episodes over the course of its 13 seasons. The series finale aired on the Fox Network on September 13, 2009. Four episodes from the final season were to have aired on Fox, but later aired in syndication on local stations from May 3 to 6, 2010, and on Adult Swim from May 17 to 20, 2010. King of the Hill was a joint production by 3 Arts Entertainment, Deedle-Dee Productions, Judgemental Films, and 20th Century Fox Television and syndicated by 20th Television.\r\n\r\nIn 2013, TV Guide ranked King of the Hill as one of the top 60 Greatest TV Cartoons of All Time","torrent":{"xt":"urn:btih:0b1a4cd998d0da369ed1caed2947179b9af929fb","amp;dn":"King+of+the+Hill+Complete+Series","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b1a4cd998d0da369ed1caed2947179b9af929fb","infoHashBuffer":{"type":"Buffer","data":[11,26,76,217,152,208,218,54,158,209,202,237,41,71,23,155,154,249,41,251]},"announce":[],"urlList":[]}}