{"title":"Gold (1934) dir. Karl Hartl  [Deutsch, w Eng subtitles]","uid":15736151,"size":888754695,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0b739487cf9da8ac4e12c8a1e4a805a6520f665f&amp;dn=Gold+%281934%29+dir.+Karl+Hartl++%5BDeutsch%2C+w+Eng+subtitles%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"loninappleton","files":2,"time":1472841860,"description":"Gold  (1934) directed by Karl Hartl for UFA Studios;   a Kino Release 2016\r\n\r\nB/W in German language with optional English subtitles which are original\r\nto the DVD.  In VLC select the subtitles from the player menu.\r\n\r\nRun time:  1 hr 33 mins\r\n\r\nIMDb: /tt0025189\r\n\r\nSummary from IMDb\r\n\r\nAfter his colleague and a mentor, Prof. Achenbach dies in a set-up accident, while trying to produce gold from the lead, Werner Holk seeks revenge. Meanwhile, a British millionaire suggests that Holk work on him on a similar project. \r\n \t\r\nCredits \r\n\r\n\tDirectors of photography, Günther Rittau, Otto Baecker, Werner Bohne ;\r\n        music, Hans-Otto Borgmann.\r\nCast \t\r\n\r\nHans Albers, \r\nBrigitte Helm, \r\nMichael Bohnen, \r\nLien Deyers, \r\nFriedrich Kayssler.\r\n\r\nMy notes\r\n\r\nThere are two films I'll be file sharing in this group. This is the first.  Aside from the provocative title , this is not Eric Von Stroheim's &quot;Greed.&quot;   &quot;Gold&quot; is from the UFA studio in the FW Murnau collection.  Film historians can say more about it but it is a recent release and it is the first time I've seen it.\r\n\r\nWhat makes :Gold&quot; it special as with the one that follows called &quot;The Sky Calls&quot;  which is Russian, the technical achievement in size and scope is significant.  As far back as the Russian silent Film &quot;Aelita Queen of Mars&quot; (public domain and available at The Internet Archive,)  the large stage is utilized as it might be in grand opera-- in the work of Edward Gordon Craig as an \r\nexample.\r\n\r\nIn &quot;Gold&quot; the German Expressionistic elements are seen  as well.  For all these reasons plus the moral tale of the hazards of making gold, &quot;Gold&quot; is a treat for the eye and is in every way state of the art for it's time.\r\n\r\nTo be precise this is a remaster rather an a &quot;restored&quot; version.  A restored\r\nfilm is always preferred since the process is more intensive in the task of removing film artifacts one frame at a time.\r\n\r\nThis torrent is a sample for those who would get the original DVD for their film history libraries and for others to enjoy everywhere.\r\n\r\nNotes written September 2, 2016","torrent":{"xt":"urn:btih:0b739487cf9da8ac4e12c8a1e4a805a6520f665f","amp;dn":"Gold+%281934%29+dir.+Karl+Hartl++%5BDeutsch%2C+w+Eng+subtitles%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b739487cf9da8ac4e12c8a1e4a805a6520f665f","infoHashBuffer":{"type":"Buffer","data":[11,115,148,135,207,157,168,172,78,18,200,161,228,168,5,166,82,15,102,95]},"announce":[],"urlList":[]}}