{"title":"Biological Interactions with Surface Charge in Biomaterials","uid":15446376,"size":9105090,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0caf21ffb7ff58954ef5929c8ca9c805eba4d6af&amp;dn=Biological+Interactions+with+Surface+Charge+in+Biomaterials&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clouderone","files":1,"time":1469890564,"description":"Biological Interactions with Surface Charge in Biomaterials - Syed A. M. Tofail (RSC, 2012).pdf\r\n\r\nWhen a biomaterial is placed inside the body, a biological response is triggered almost instantaneously. With devices that need to remain in the body for long periods, such interactions can cause encrustation, plaque formation and aseptic loosening on the surface. These problems contribute to the patient's trauma and increase the risk of death. Electrical properties, such as local electrostatic charge distribution, play a significant role in defining biological interactions, although this is often masked by other factors. This book describes the fundamental principles of this phenomenon before providing a more detailed scientific background. It covers the development of the relevant technologies and their applications in therapeutic devices such as MRSA-resistant fabrics, cardiovascular and urological stents, orthopaedic implants, and grafts. Academic and graduate students interested in producing a selective biological response at the surface of a given biomaterial will find the detailed coverage of interactions at the nanometre scale useful. Practitioners will also benefit from guidance on how to pre-screen many inappropriate designs of biomedical devices long before any expensive, animal or potentially risky clinical trials. Enhanced by the use of case studies, the book is divided in to four topical sections. The final section is dedicated to the application of related topics making the book unique in its pragmatic approach to combining high end interdisciplinary scientific knowledge with commercially viable new technologies. Contributing to the newly emerging discipline of 'nanomedicine', the book is written not only by experts from each relevant specialty but also by practitioners such as clinicians and device engineers from industry","torrent":{"xt":"urn:btih:0caf21ffb7ff58954ef5929c8ca9c805eba4d6af","amp;dn":"Biological+Interactions+with+Surface+Charge+in+Biomaterials","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0caf21ffb7ff58954ef5929c8ca9c805eba4d6af","infoHashBuffer":{"type":"Buffer","data":[12,175,33,255,183,255,88,149,78,245,146,156,140,169,200,5,235,164,214,175]},"announce":[],"urlList":[]}}