{"title":"Laura Ingraham Podcast August 2 2016","uid":15479317,"size":34797316,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:132fceac3feb76a4da744ece59281c85242f66de&amp;dn=Laura+Ingraham+Podcast+August+2+2016&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1470226962,"description":"Laura Ingraham August 2 , 2016 podcast\r\n\r\nGuest Lineup\r\nJudge Andrew Napolitano - Fox News senior judicial analyst\r\nSean Spicer - RNC Chief Strategist and Communications Director\r\nBen Kaplan - CEO of PR Hacker\r\n\r\nU.S. Sent Cash to Iran as Americans Were Freed\r\nThe Obama administration secretly organized an airlift of $400 million worth of cash to Iran that coincided with the January release of four Americans detained in Tehran, according to U.S. and European officials and congressional staff briefed on the operation afterward.\r\n\r\nKhan Deletes Law Firm Website that Specialized in Muslim Immigration...\r\nKhizr Khan, the Muslim Gold Star father that Democrats and their allies media wide have been using to hammer GOP presidential nominee Donald J. Trump, has deleted his law firm's website from the Internet.\r\n\r\nFather of Benghazi Victim: Either Hillary Is a Liar or Has a Bad Memory From Head Injury\r\nCharles Woods, the father of Tyrone Woods, one of the Benghazi soldiers who was killed defending his fellow Americans on the night of September 11, 2012, had something to say to Democratic nominee Hillary Clinton on Tuesday regarding her interview on Fox News Sunday. During her conversation with Chris Wallace, Clinton suggested she had not lied to the Benghazi victims' families and told them the terror attack was actually the spontaneous reaction to an offensive internet video. She held no &quot;ill feeling&quot; toward the family members because their memories must just be fuzzy, she insisted.\r\n \nhttp://www.lauraingraham.com/","torrent":{"xt":"urn:btih:132fceac3feb76a4da744ece59281c85242f66de","amp;dn":"Laura+Ingraham+Podcast+August+2+2016","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"132fceac3feb76a4da744ece59281c85242f66de","infoHashBuffer":{"type":"Buffer","data":[19,47,206,172,63,235,118,164,218,116,78,206,89,40,28,133,36,47,102,222]},"announce":[],"urlList":[]}}