{"title":"[PC-Game] Outbreak Pandemic Evolution E.A 2016","uid":15854305,"size":2447826482,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:14501fed9ac08e4b1d4d07e2c1e6fdd27cd024ae&amp;dn=%5BPC-Game%5D+Outbreak+Pandemic+Evolution+E.A+2016&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"masterega-rd","files":4,"time":1474218583,"description":"Outbreak is a first person survival game set in a beautiful open world where you have to scavenge by day and survive the night in your hi-tech base dug into the mountains. Scavenge the land taking everything you can to recycle into turrets, ammo, traps, guns, food and gadgets. Other scavengers will shoot on sight but as night time falls an even greater threat will appear. Fortify your base, keep it repaired and research a weapon that will end the mutant outbreak.\r\n\r\nThe factions in the game fight each other on the map. It is up to you how you influence this fight - taking out military troops and cleaning up areas will strategically weaken them as they are loosing ground &amp; numbers. Mutants are a bit harder to stop as you first have to figure out how to push them back which also requires capturing one of them alive, they also evolve over time and you will see more variations of them.\r\nCOOP SURVIVAL\r\nThe game allows you to play coop with friends, hosting your own servers you can control who joins your game. Time is essential as the longer you play the larger the outbreak will become as it spawns out three classes of Mutants, each one larger and more deadlier than the last. You must craft all manner of defenses to survive the attacks as well as find a way to destroy the mutant threat. But first you must secure the power station so that your base is operational, everything requires power, your turrets, recycler, doors and your lights. Keep everything repaired and you may survive the night.\r\n\r\nLanguege: English only","torrent":{"xt":"urn:btih:14501fed9ac08e4b1d4d07e2c1e6fdd27cd024ae","amp;dn":"%5BPC-Game%5D+Outbreak+Pandemic+Evolution+E.A+2016","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14501fed9ac08e4b1d4d07e2c1e6fdd27cd024ae","infoHashBuffer":{"type":"Buffer","data":[20,80,31,237,154,192,142,75,29,77,7,226,193,230,253,210,124,208,36,174]},"announce":[],"urlList":[]}}