{"title":"GRÄSPOJKEN","uid":15573766,"size":422641228,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:16092b459d81aefefeccf531ef530e87954bd509&amp;dn=GR%26Auml%3BSPOJKEN&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":16,"uploader":"darkdars","files":112,"time":1471297370,"description":"\nDet är under vårterminen 1987 som allt brakar loss. 12-årige Kalle blir halvt föräldralös när morsan får en flipp och drar till Indien. Farsan är upptagen med sina problem och lillebrorsan Björn har blivit sjukligt besatt av skejtboard. Kalle lämnas ensam att utforska den magiska brytpunkten mellan barndom och tonår en period i livet där vad som helst kan hända. \r\nEn dag sticker en späd ljusgrön stjälk upp ur krukan i pojkrummet. Den mystiska plantan ser inte mycket ut för världen men lyckas ändå vända tillvaron uppochner. \r\nI skolan guppar klasskamraten Petras bröst under t-shirten och gör det svårt med koncentrationen. Inte konstigt att man kan känna behov av en hobby, något att skingra de tusentals tankar som flyger genom skallen med. \r\nOdlingen som snart fyller sommarstugans källare är inte bara olaglig. Den drar till sig skumma typer, och en mängd helt nya problem \r\n\r\nGräspojken är en varm, kärleksfull och humoristisk berättelse om en ung man i en dysfunktionell familj, och samtidigt en hisnande skröna och rolig uppväxtskildring om Kalle och hans familj i 1980-talets Göteborg. Den handlar om att växa upp och leva ut sina drömmar men framför allt om hur Kalle blir av med oskulden och med hjälp av familjens nymfparakit blir Kungen av Majorna.\r\n\r\n&quot;Gräspojken av Christer Lundberg är så drabbande, spännande, underbart omoralisk och kul att jag ligger vaken länge Det är ljuvligt och jag älskar Gräspojken.&quot;\r\nTäppas Fogelberg\r\n\r\n&quot;Hejdlöst rolig.&quot;\r\nSydsvenskan\r\n\r\n&quot;En burlesk crazy-komedi utan pekpinnar, lite liknande de skrönor Arto Paasilinna brukar koka ihop en söt pralin av festliga förvecklingar och dråpliga dårfinkigheter.&quot;\r\nVärmlands Folkblad","torrent":{"xt":"urn:btih:16092b459d81aefefeccf531ef530e87954bd509","amp;dn":"GR%26Auml%3BSPOJKEN","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16092b459d81aefefeccf531ef530e87954bd509","infoHashBuffer":{"type":"Buffer","data":[22,9,43,69,157,129,174,254,254,204,245,49,239,83,14,135,149,75,213,9]},"announce":[],"urlList":[]}}