{"title":"Nanosilicon - Vijay Kumar","uid":15473527,"size":24555645,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1cbf58cfb0da07003809f25c77029c872bc4c965&amp;dn=Nanosilicon+-+Vijay+Kumar&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"clouderone","files":1,"time":1470163460,"description":"Nanosilicon - Vijay Kumar (Elsevier, 2007).pdf\r\n\r\nProperties of nanosilicon in the form of nanoparticles, nanowires, nanotubes, and as porous material are of great interest. They can be used in finding suitable components for future miniature devices, and for the more exciting possibilities of novel optoelectronic applications due to bright luminescence from porous silicon, nanoparticles and nanowires. New findings from research into metal encapsulated clusters, silicon fullerenes and nanotubes have opened up a new paradigm in nanosilicon research and this could lead to large scale production of nanoparticles with control on size and shape as well as novel quasi one-dimensional structures. There are possibilities of using silicon as an optical material and in the development of a silicon laser. \r\n\r\nIn this book leading experts cover state-of-the-art experimental and theoretical advances in the different forms of nanosilicon. Furthermore, applications of nanosilicon to single electron transistors, as photonic material, chemical and biological sensors at molecular scale, and silicon nanowire devices are also discussed. Self-assemblies of silicon nanoforms are important for applications. These developments are also related to cage structures of silicon in clathrates. With an interesting focus on the bottlenecks in the advancement of silicon based technology, this book provides a much-needed overview of the current state of understanding of nanosilicon research.\r\n\r\n* Latest developments in nanoparticles, nanowires and nanotubes of silicon \r\n* Focus on nanosilicon - a very timely subject attracting large interest \r\n* Novel chapters on metal encapsulated silicon clusters and nanotubes","torrent":{"xt":"urn:btih:1cbf58cfb0da07003809f25c77029c872bc4c965","amp;dn":"Nanosilicon+-+Vijay+Kumar","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1cbf58cfb0da07003809f25c77029c872bc4c965","infoHashBuffer":{"type":"Buffer","data":[28,191,88,207,176,218,7,0,56,9,242,92,119,2,156,135,43,196,201,101]},"announce":[],"urlList":[]}}