{"title":"Blue Devils 2016 - As Dreams Are Made On - DCI West","uid":15253664,"size":761702196,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:23d6fc430c3361aea9a525e938e5dad51bd118ef&amp;dn=Blue+Devils+2016+-+As+Dreams+Are+Made+On+-+DCI+West&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"DCIShows","files":1,"time":1468088741,"description":"We are such stuff as dreams are made on, and our little life is rounded with a sleep.\r\n\r\nWilliam Shakespeare is continually praised as a great philosopher, psychologist, and poet — the rich fabric of his plays bears this out. THE TEMPEST, written in 1611, was Shakespeare's last major work, his genius demonstrated in the play's artful construction. The work is filled with the themes of Love, Sin, Atonement, Forgiveness, and Reconciliation.\r\n\r\nProspero, the scholarly and mysterious Duke of Milan, loses his crown to his scheming brother, Antonio. Exiled from their country and cast out to die at sea, Prospero and his daughter Miranda are saved when their ship washes ashore on an enchanted island. With the help of two island inhabitants, the spirit Ariel and the savage Caliban, Prospero soon establishes a new kingdom.\r\n\r\nThe isle is full of noises, sounds and sweet airs that give delight and hurt not.\r\n\r\nOne of the most remarkable aspects of the play is how consciously Shakespeare bids farewell to past trends and welcomes new ones. While many of Shakespeare’s plays have inspired musical settings through the years, what’s unique about THE TEMPEST is how few changes are necessary to make the play adaptable to music of many centuries, not to mention film and dance.\r\n\r\nThe 2016 Blue Devils set sail into a whirlwind of sound design including original works by music director David Glyde and Grammy award winner Gordon Goodwin. As wildly varied as the characters of Prospero's kingdom, the soundshore brings forth Honneger and Herrmann alongside such names as Skrillex and Diplo. Anything is possible in the magical wake of invention.\r\n\r\nO, wonder!\r\nHow many goodly creatures are there here!\r\nHow beauteous mankind is! O brave new world,\r\nThat has such people in't!\r\n\r\nThe 2016 Blue Devils present As Dreams Are Made On and they will travel the US with 150 extraordinary performers bringing the imagery and fantasy of Shakespeare's imagination to life. In recognition of the 400th anniversary of his death, DCI's most honored drum and bugle corps will pay tribute to Shakespeare's creativity and vision. The musical and visual potency of THE TEMPEST becomes a map of excellence, artistry, and the ability of theatre to transcend the pageantry landscape.\r\n\r\nHell is empty\r\nAnd all the devils are here","torrent":{"xt":"urn:btih:23d6fc430c3361aea9a525e938e5dad51bd118ef","amp;dn":"Blue+Devils+2016+-+As+Dreams+Are+Made+On+-+DCI+West","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23d6fc430c3361aea9a525e938e5dad51bd118ef","infoHashBuffer":{"type":"Buffer","data":[35,214,252,67,12,51,97,174,169,165,37,233,56,229,218,213,27,209,24,239]},"announce":[],"urlList":[]}}