{"title":"NUBILE FILMS - Alexa Grace | Blonde Orgasm | 07.09.2016 - NEW JU","uid":15251297,"size":381421102,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:26b45142c695dd69e4453a5b51abe8b0a54a3aea&amp;dn=NUBILE+FILMS+-+Alexa+Grace+%7C+Blonde+Orgasm+%7C+07.09.2016+-+NEW+JU&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TechLatina","files":1,"time":1468055737,"description":"NUBILE FILMS - Alexa Grace | Blonde Orgasm | 07.09.2016 - NEW JULY 9th,2016 | SD MP4\r\n\r\n\r\n\r\n\r\nDESCRIPTION\r\n\r\n\r\nSex kitten Alexa Grace is happy to be seduced in the kitchen by Van Wylde. She returns his kisses with full eagerness as his hands roam her tender body, finally coming to rest on her thong-clad ass for a few squeezes before he takes her by the hand and leads her to the island for some real loving. Slipping her underwear down her long legs, Van pulls her close to feel the power of his erection before dropping to his knees before his bald pussied goddess.\r\n\r\nTaking a quick lap with his tongue, Van smiles at the delicious flavor and then leans forward to lap away at his sweet treat. His long slow licks are just what Alexa needs to get all hot and bothered and ready to fuck, but Van isn't done with his seduction quite yet. Next he peels off Alexa's tank top so that he can worship her small boobs and rock hard nipples with his mouth while rubbing his hand against her ultra-tender clit.\r\n\r\nAlthough she would love to let Van continue his oral seduction forever, Alexa isn't about to let her lover have all the fun. Dropping to her knees, she pulls Van's pants and briefs down so that she can put her hands and mouth to work. Her warm suction and talented tongue play are exactly what Van needs to get hard as a rock and eager for more.\r\n\r\nTaking Van by the hand, Alexa leads him to a different part of the kitchen where she can turn her back to him and prop her leg up on a chair. That position makes it easy for Van to slide into her creamy twat. He wastes no time once he's in, rubbing her tits and pumping his hips to fill and fuck her snatch at a speed designed to keep her moaning.\r\n\r\nWhen Alexa turns in Van's arms and lifts one leg, the new position hits just the right spot. Her moans increase in volume as Van rubs against her g-spot, creating friction that brings her ever-closer to the inevitable explosion of joy. She's not quite ready to cum, however, so she presses Van onto his back on the counter goes back to work sucking him off. As soon as she's satisfied, she turns around and impales herself on Van's fuck stick for a reverse cowgirl style stiffie ride. When she turns around to face Van as she rides him like a personal steed, he can tell by the look on her face that she's about to explode.\r\n\r\nWhen Alexa's climax hits her it's a thing of beauty. Her whole body pulsates with ecstasy as she throws her head back and rides the wave. Only after the aftershocks are complete does Van lay her on her side to spoon for a few moments as he reaches the end of his own endurance. Pulling out at the last moment, he covers Alexa's smooth mound with cum before she presses him back into her fuck hole for a few last moments of enjoyment","torrent":{"xt":"urn:btih:26b45142c695dd69e4453a5b51abe8b0a54a3aea","amp;dn":"NUBILE+FILMS+-+Alexa+Grace+%7C+Blonde+Orgasm+%7C+07.09.2016+-+NEW+JU","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26b45142c695dd69e4453a5b51abe8b0a54a3aea","infoHashBuffer":{"type":"Buffer","data":[38,180,81,66,198,149,221,105,228,69,58,91,81,171,232,176,165,74,58,234]},"announce":[],"urlList":[]}}