{"title":"Millennium 2 - Take Me Higher v1.1","uid":15447715,"size":124375255,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2a5a6af3ef8ea91e8e544cde017ffeec36a3c41f&amp;dn=Millennium+2+-+Take+Me+Higher+v1.1&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dauphong","files":1,"time":1469909668,"description":"Millennium 2 is the second episode of Aldorlea's flagship series (the makers behind The Book of Legends, Moonchild, Dreamscape, 3 Stars of Destiny, Asguaard, Undefeated etc.).\r\nFeaturing an immersive story written by Indinera (as well as characters and dialogs developed by him), this game is a fantastic chapter to a series greenlighted by the Steam community that spans over 5 episodes and features more than 20 characters in total.\r\nKey Features\r\n\r\n    30+ achievements to unlock - can you get them all?\r\n    4 levels of difficulty - choose your difficulty and enjoy replaying the game at its most challenging\r\n    Choose visible or invisible monsters - cater to the encounter style you prefer\r\n    Optional guiding arrows - enjoy the game without the worry of having to look up a walkthrough or guide\r\n    Dozens of secret rooms - for those who like to explore and discover every secret\r\n    40 quests - easy request from a villager or very tricky riddle to solve, help people as you progress in your adventure\r\n    Battle superb monsters including 8 Animal Kings - they are the most dangerous and feared creatures out there, so beware\r\n    Get help from Jeanne - your magically-gifted fairy friend that you can summon when you really need that little something extra\r\n    Gorgeous retro graphics and musics - Millennium features high production values in its genre, all for your enjoyment","torrent":{"xt":"urn:btih:2a5a6af3ef8ea91e8e544cde017ffeec36a3c41f","amp;dn":"Millennium+2+-+Take+Me+Higher+v1.1","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a5a6af3ef8ea91e8e544cde017ffeec36a3c41f","infoHashBuffer":{"type":"Buffer","data":[42,90,106,243,239,142,169,30,142,84,76,222,1,127,254,236,54,163,196,31]},"announce":[],"urlList":[]}}