{"title":"Blood Orange - Discography (2011-2016) [FLAC]","uid":15296341,"size":2954868545,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:32f640262147d3e03d715f117930431ea1d37c32&amp;dn=Blood+Orange+-+Discography+%282011-2016%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"politux","files":80,"time":1468451628,"description":"\n  Blood Orange - Discography (2011-2016) [FLAC]\r\n\r\n  Genre: Rhythm and Blues\r\n  Source: CD, WEB, vinyl\r\n  Codec: FLAC\r\n  Bit rates: ~1,000 - 3,000 kbps\r\n  Bit depth: 16, 24\r\n  Sample rates: 44.1 - 96 kHz\r\n\r\n  Albums (16.44)\r\n  \r\n  2011 Coastal Grooves \r\n  2013 Cupid Deluxe \r\n  2016 Freetown Sound\r\n\r\n  Vinyl Rips (24.96)\r\n\r\n  2011 Coastal Grooves \r\n  2013 Cupid Deluxe \r\n\r\n  After splitting with his band the Test Icicles and then recording as Lightspeed Champion, singer/songwriter Devonté Hynes switched up styles again and began making music under the pseudonym Blood Orange. For Hynes, a cult favorite who also worked on the side as a songwriter for some popular artists (including Florence + the Machine, Theophilus London, and Solange Knowles), and as a fashion consultant for Jay-Z's Rocawear, Blood Orange seemed like his most streamlined project, with R&amp;B grooves and atmospheric chillwave keyboards. The debut album, Coastal Grooves, was released in the summer of 2011 on Domino Records. Along with spending more time working with Solange in 2012 -- the result being the True EP released in late 2012 -- Hynes also found time to collaborate with Nedelle Torrisi, Sky Ferreira, Foals, and even Britney Spears. Hynes' next move as Blood Orange was to release the decidedly '80s- and '90s-influenced follow-up album Cupid Deluxe in late 2013. Although his pal Solange didn't guest on the album, many friends did, including Caroline Polachek of Chairlift, Friends' Samantha Urbani, Dirty Projectors' David Longstreth, and Clams Casino. 2013 also saw the release of the producer's first film score for Gia Coppola's drama Palo Alto. Blood Orange returned in late 2015 with the track &quot;Sandra's Smile,&quot; an ode to Sandra Bland, who was found dead in a jail cell in Texas after having been arrested for a minor traffic violation. He returned in the summer of 2016 with his third full-length effort, Freetown Sound. The record was named after the capital of Sierra Leone, where his father grew up, and documented a number of issues including race, sex, sexism, and religion","torrent":{"xt":"urn:btih:32f640262147d3e03d715f117930431ea1d37c32","amp;dn":"Blood+Orange+-+Discography+%282011-2016%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32f640262147d3e03d715f117930431ea1d37c32","infoHashBuffer":{"type":"Buffer","data":[50,246,64,38,33,71,211,224,61,113,95,17,121,48,67,30,161,211,124,50]},"announce":[],"urlList":[]}}