{"title":"Nanobiomaterials in Antimicrobial Therapy","uid":15461369,"size":22510485,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:34a78e430a11347160d6ec228ebb48dc832e7cb2&amp;dn=Nanobiomaterials+in+Antimicrobial+Therapy&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clouderone","files":1,"time":1470051338,"description":"Applications of Nanobiomaterials Vol. 6 - Nanobiomaterials in Antimicrobial Therapy - A.M. Grumezescu (WA, 2016).pdf\r\n\r\nNanobiomaterials in Antimicrobial Therapy presents novel antimicrobial approaches that enable nanotechnology to be used effectively in the treatment of infections. This field has gained a large amount of interest over the last decade, in response to the high resistance of pathogens to antibiotics.\r\n\r\nLeading researchers from around the world discuss the synthesis routes of nanobiomaterials, characterization, and their applications as antimicrobial agents. The books covers various aspects: mechanisms of toxicity for inorganic nanoparticles against bacteria; the development of excellent carriers for the transport of a high variety of antimicrobials; the use of nanomaterials to facilitate both diagnosis and therapeutic approaches against infectious agents; strategies to control biofilms based on enzymes, biosurfactants, or magnetotactic bacteria; bacterial adhesion onto polymeric surfaces and novel materials; and antimicrobial photodynamic inactivation.\r\n\r\nThis book will be of interest to postdoctoral researchers, professors and students engaged in the fields of materials science, biotechnology and applied chemistry. It will also be highly valuable to those working in industry, including pharmaceutics and biotechnology companies, medical researchers, biomedical engineers and advanced clinicians.\r\n\r\n\r\n\r\nA methodical approach to this highly relevant subject for researchers, practitioners and students working in biomedical, biotechnological and engineering fields.\r\nA valuable guide to recent scientific progress and the latest application methods.\r\nProposes novel opportunities and ideas for developing or improving technologies in nanomedicine and nanobiology","torrent":{"xt":"urn:btih:34a78e430a11347160d6ec228ebb48dc832e7cb2","amp;dn":"Nanobiomaterials+in+Antimicrobial+Therapy","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34a78e430a11347160d6ec228ebb48dc832e7cb2","infoHashBuffer":{"type":"Buffer","data":[52,167,142,67,10,17,52,113,96,214,236,34,142,187,72,220,131,46,124,178]},"announce":[],"urlList":[]}}