{"title":"Phantom of the Kill v1.1.2 + mod [apkpita]","uid":15341653,"size":70868570,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:35f3f26dd7933a4b0603428a9949a510edfb9deb&amp;dn=Phantom+of+the+Kill+v1.1.2+%2B+mod+%5Bapkpita%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tiropitaki","files":2,"time":1468844572,"description":"Introducing Phantom of the Kill, the tactical role-playing game that combines strategy with drama! Join warriors named after legendary weapons in their epic battle against evil. Turn the tides of war with a swipe of your finger!\r\n\r\nOPENING ANIMATION SUPERVISED BY MAMORU OSHII!\r\nWatch the amazing opening, created under the editorial supervision of Mamoru Oshii, the world-famous director of Mobile Police Patlabor and Ghost in the Shell! See how the in-game movies push the boundaries of animation as they immerse you in the world of Phantom of the Kill!\r\n\r\nTHE DEFINITIVE STRATEGY RPG\r\nIntroducing Phantom of the Kill, the tactical role-playing game that combines strategy with drama! \r\nJoin warriors named after legendary weapons in their epic battle against evil, and turn the tides of war with a swipe of your finger.\r\n\r\nFIGHT YOUR WAY TO GLORY WITH WILD UNITS AND WEAPONS\r\nWith over fifty unit classes and six weapon types, the possibilities truly are endless. Add dragoons, swordmasters, mages, gunners, and other units to your team, form the perfect party with insanely cool weapons, then lead them to victory!\r\nTry your hand with axes, lances, swords and other weapons at your disposal. How will you defeat your enemies?\r\nNOTES\r\nPhantom of the Kill is free to download and play, however, some game items can also be purchased for real money. A network connection is required to play this game.\r\n\r\nCOMPATIBILITY\r\nA smartphone or tablet with Android 4.1 or later, 2GB RAM or more, and 1.5 GB disk space or more is recommended. * Some devices with these specifications may still not be able to run this application.\r\n\r\nWhat’s new:\r\n- Brave Frontier crossover\r\n- Tutorial tweaks\r\n- Daily mission feature upgrade\r\n- Minor fixes\r\n\r\nMod Info:\r\n1 Hit KO\r\n\r\nRequirements: Android OS 4.1 and up","torrent":{"xt":"urn:btih:35f3f26dd7933a4b0603428a9949a510edfb9deb","amp;dn":"Phantom+of+the+Kill+v1.1.2+%2B+mod+%5Bapkpita%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35f3f26dd7933a4b0603428a9949a510edfb9deb","infoHashBuffer":{"type":"Buffer","data":[53,243,242,109,215,147,58,75,6,3,66,138,153,73,165,16,237,251,157,235]},"announce":[],"urlList":[]}}