{"title":"Hidden Secrets - Part 160 - UFOs Angels Nephilim Spirits Witches","uid":15441780,"size":8344271526,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:3602f01ee97f58721971b46016d439a7492e726d&amp;dn=Hidden+Secrets+-+Part+160+-+UFOs+Angels+Nephilim+Spirits+Witches&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":94,"time":1469828379,"description":"Arthur C. Clarke's Mysterious World UFOs 1980:\r\nAn investigation of unexplained phenomena and mysteries around the world.  Arthur C. Clarke's Mysterious World (Ep. 10) - Right away Clarke removes any doubt as to his opinion of UFOs -- he states that he has been interested for 50 years and claims to have observed at least six. He even goes on to say, sightings are very common. He does, however, reserve his opinions concerning them; revealing more and more of his ideas on the subject as the episode progresses.\r\n-----------------------------------------------------------------\r\n\r\n2001 National Press Club Event:\r\nOn Wednesday, May 9th, 2001, over twenty military, intelligence, government, corporate and scientific witnesses came forward at the National Press Club in Washington, DC to establish the reality of UFOs or extraterrestrial vehicles, extraterrestrial life forms, and resulting advanced energy and propulsion technologies. The weight of this first-hand testimony, along with supporting government documentation and other evidence, will establish without any doubt the reality of these phenomena. DVD is available to order at: \nhttp://www.DisclosureProject.org\r\n-----------------------------------------------------------------\r\n\r\nCentury Of Manipulation:\r\nA history of false flags, war opportunism, Al-Qaeda and other deceptions.  View the amazingly distugsting footage of documented evidence exposing the government's involvement in terrorist activities within its own national borders upon its own citizens.  This is the world in which we all live!  Who do YOU &quot;Trust?&quot; \r\n-----------------------------------------------------------------\r\n\r\nThe End is Near by David Lankford:\r\nPastor Lankford on Obamacare as Mark of the Beast; Prepping[Self-Reliance] as Common/&quot;Horse&quot; Sense(Stable Thinking) ;-D and The Sins of Sodom.  Steve Quayle's favorite preacher--Homespun Scriptural-based Wisdom.  Very Refreshing.\r\n-----------------------------------------------------------------\r\n\r\nNASA AND THE HOLY GRAIL by Michael Hoggard:\r\nFor years the United States has led the world in pioneering space travel, even sending men to the moon. This has led to other nations, like China, developing their own space programs. The United States is now talking about sending a man to Mars. Is this possible? Michael Hoggard talks about space travel and how God views man's attempts to explore the universe.\r\n\r\nMike Hoggard exposes the connection between NASA and the Holy Grail... What could NASA possibly have to do with ancient gods and goddesses in this age of science and technology? Pastor Mike Hoggard takes a step back and examines startling pieces of evidence to prove that NASA's programs are not exactly what they purport to be: gathering knowledge of the solar system and the universe.\r\n\r\nFrom NASA's own website, Pastor Mike reveals the occult connections of the tax-funded space program to gods, goddesses, occult numbers, symbols and rituals and how it all points to a future that wants to bring in the hybridization of mankind.\r\n\r\nSatan, the great deceiver, is trying to bring his kingdom on earth, fulfilling his promise to Eve, 'ye shall be as gods'. Find out the true meaning of their probe to Jupiter and their recent launch of the G.R.A.I.L. satellites to the moon. Explaining these phenomena through the pages of the King James Bible, Pastor Mike warns us that the spiritual battle for humankind is ever more urgent for the year 2012.\r\n------------------------------------------------------------------\r\n\r\nThe Majestic Documents Authentication and Interpretation:\r\nMichael S. Heiser, PhD &quot;The Majestic Documents: Authentication and Interpretation&quot; as presented at the International UFO Conference","torrent":{"xt":"urn:btih:3602f01ee97f58721971b46016d439a7492e726d","amp;dn":"Hidden+Secrets+-+Part+160+-+UFOs+Angels+Nephilim+Spirits+Witches","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3602f01ee97f58721971b46016d439a7492e726d","infoHashBuffer":{"type":"Buffer","data":[54,2,240,30,233,127,88,114,25,113,180,96,22,212,57,167,73,46,114,109]},"announce":[],"urlList":[]}}