{"title":"Windows XP Professional SP3 (32 Bit) [DEVIOUS]","uid":15766487,"size":661735757,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:36e5c297a1dfa71d9c8ed4c5e71be5bffd9af206&amp;dn=+Windows+XP+Professional+SP3+%2832+Bit%29+%5BDEVIOUS%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"deviousc","files":3,"time":1473153346,"description":"\n\r\nWindows XP Professional SP3 (32 Bit) [DEVIOUS]\r\n\r\nOS:\t\tWindows\r\nSize:\t\t631 MB\r\nLanguage:\tEnglish\r\nType:\t\tOS\r\nTags:\t\tWindows XP, Windows,Windows XP Professional SP3,XP SP3,XP 32 Bits,32 Bits,Operating System,OS,Devious\r\n\r\n\r\nWindows XP is a personal computer operating system that was produced by Microsoft as part of the Windows NT family of operating systems. The operating system was released to manufacturing on August 24, 2001, and generally released for retail sale on October 25, 2001.\r\n\r\nDevelopment of Windows XP began in the late 1990s as &quot;Neptune&quot;, an operating system built on the Windows NT kernel which was intended specifically for mainstream consumer use—an updated version of Windows 2000 was also originally planned for the business market. However, in January 2000, both projects were shelved in favor of a single OS codenamed &quot;Whistler&quot;, which would serve as a single OS platform for both consumer and business markets. Windows XP was a major advance from the MS-DOS based versions of Windows in security, stability and efficiency due to its use of Windows NT underpinnings. It introduced a significantly redesigned graphical user interface and was the first version of Windows to use product activation in an effort to reduce its copyright infringement.\r\n\r\nUpon its release Windows XP received generally positive reviews, with critics noting increased performance (especially in comparison to Windows ME), a more intuitive user interface, improved hardware support, and its expanded multimedia capabilities. Despite some initial concerns over the new licensing model and product activation system, Windows XP eventually proved to be popular and widely used. It is estimated that at least 400 million copies of Windows XP were sold globally within its first five years of availability, and at least one billion copies were sold by April 2014. Sales of Windows XP licenses to original equipment manufacturers (OEMs) ceased on June 30, 2008, but continued for netbooks until October 2010. Windows XP remained popular even after the release of newer versions, particularly due to the poorly received release of its successor Windows Vista. Vista's 2009 successor, Windows 7, only overtook XP in total market share at the end of 2011.\r\n\r\n\r\nKey: Microsoft Windows XP\r\nMR49R-DRJXX-M6PX2-V96BF-8CKBJ","torrent":{"xt":"urn:btih:36e5c297a1dfa71d9c8ed4c5e71be5bffd9af206","amp;dn":"+Windows+XP+Professional+SP3+%2832+Bit%29+%5BDEVIOUS%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36e5c297a1dfa71d9c8ed4c5e71be5bffd9af206","infoHashBuffer":{"type":"Buffer","data":[54,229,194,151,161,223,167,29,156,142,212,197,231,27,229,191,253,154,242,6]},"announce":[],"urlList":[]}}