{"title":"Lucifer.S01.Complete-WinterStreet","uid":15718387,"size":3482446868,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:37e49405410d4fc3c9b91033b930efe217460540&amp;dn=Lucifer.S01.Complete-WinterStreet&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jsylvers","files":14,"time":1472649361,"description":"Lucifer S01E01 - Pilot\r\n\r\nLucifer has decided to take a vacation from Hell. When a former &quot;client&quot; turns up on his doorstep and is soon murdered, Lucifer vows to make the person responsible pay... and joins forces with a police detective to make it happen.\r\n\r\nLucifer S01E02 - Lucifer, Stay. Good Devil.\r\n\r\nAs Lucifer begins realizing that he's changing because of his time on Earth, Chloe unofficially investigates the case of a paparazzo who drove an actor's son to his death.\r\n\r\nLucifer S01E03 - The Would-Be Prince of Darkness\r\n\r\nLucifer encourages a young quarterback to lose his virginity with an attractive woman at a party. However, the woman turns up dead the next day in the quarterback's swimming pool, and Lucifer sets out to find the guilty party and punish them.\r\n\r\nLucifer S01E04 - Manly Whatnots\r\n\r\nLucifer misunderstands Linda's suggestion that he demystify Chloe and decides to try sleeping with her. Meanwhile, Chloe pursues the case of a missing girl who disappeared after meeting the head of a &quot;Player&quot; organization.\r\n\r\nLucifer S01E05 - Sweet Kicks\r\n\r\nLucifer becomes mixed up with a gang war when a woman belonging to one gang gets killed at a fashion show, and the designer is a former member of a rival gang. Meanwhile, Dan asks Lucifer to look after Chloe, and Amenadiel starts infiltrating Lucifer's life by approaching Linda.\r\n\r\nLucifer S01E06 - Favorite Son Summary:\r\n\r\nA &quot;simple&quot; robbery and murder holds no interest for Lucifer... until he discovers that he was the one who was robbed. Dan has to choose between his family and his job, and has an unfortunate encounter with Maze. Meanwhile, Amenaziel gives Linda advise on how to deal with her patient Lucifer.\r\n\r\nLucifer S01E07 - Wingman\r\n\r\nUnable to reveal the truth without admitting to Chloe that he lied, Lucifer asks Amenadiel to help him recover his stolen wings. Meanwhile, Chloe and Dan try to determine what really happened in the Palmetto case.\r\n\r\nLucifer S01E08 - Et Tu, Doctor?\r\n\r\nLucifer tries to deal with his jealousy when it looks like Chloe and Dan are trying to get back together. He wants Linda to &quot;fix&quot; Chloe, and convinces a judge to appoint Linda to go through a murdered therapist's files. Meanwhile, Malcolm plays Chloe a visit.\r\n\r\nLucifer S01E09 - A Priest Walks Into a Bar Summary:\r\n\r\nA priest, Father Frank, asks Lucifer for help stopping a teenager from getting involved in a local drug ring. Lucifer questions whether Frank is sincere, and whether the boy can be saved. Meanwhile, Malcolm pressures Dan to get a gun for him out of Evidence.\r\n\r\nLucifer S01E10 - Pops Summary:\r\n\r\nLucifer and Chloe try to solve the case of a poisoned restaurant owner, and suspect that his son is the killer. Meanwhile, Maze asks Linda for advice, and Chloe's actress mother pays a visit.\r\n\r\nLucifer S01E11 - St. Lucifer\r\n\r\nWhen a former NBA player and current philanthropist is murdered, Chloe suspects that he wasn't as benevolent as he seemed. Meanwhile, Lucifer explores his own benevolence after he refuses to sleep with Chloe, and comes to a realization about his bouts of vulnerability.\r\n\r\nLucifer S01E12 - #TeamLucifer Summary:\r\n\r\nWhen a woman is found dead in a theater, &quot;Hail Lucifer&quot; carved in her back, the trail leads to a Satanic cult... and a killer who is possibly trying to impress Lucifer. Meanwhile, Maze finds herself torn between her duty and her feelings, and Amenadiel pays Lucifer a visit.\r\n\r\nLucifer S01E13 - Take Me Back to Hell\r\n\r\nChloe and Dan both realize that Lucifer is innocent of murder, but Dan has to sacrifice his career and his freedom to clear Lucifer's name. Meanwhile, Amenadiel is mortally wounded, and Lucifer makes a deal with his Father","torrent":{"xt":"urn:btih:37e49405410d4fc3c9b91033b930efe217460540","amp;dn":"Lucifer.S01.Complete-WinterStreet","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37e49405410d4fc3c9b91033b930efe217460540","infoHashBuffer":{"type":"Buffer","data":[55,228,148,5,65,13,79,195,201,185,16,51,185,48,239,226,23,70,5,64]},"announce":[],"urlList":[]}}