{"title":"The Sims 3 + All Expansions","uid":15234427,"size":27552072376,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:39e4d21143a3dd65f65b19aa54ffb65f78e258bf&amp;dn=The+Sims+3+%2B+All+Expansions&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Atum555","files":73,"time":1467865983,"description":"This is the complete Sims 3 installation plus all expansions.\r\n\r\nI was sick of reinstalling the software key by key, with patching, it \r\ntakes forever to install all of it by hand. So I decided to build a complete installer that installs the base game and all the expansions without the need for swapping disks or putting key after key in, or running installer after installer. This is by far the easiest way to install the complete Sims 3 collection.\r\n\r\nAll expansions are included, and the game is patched to 1.63.\r\n\r\n* Parts included:\r\n\r\nThe Sims 3 Base Game install\r\nThe Sims 3: World Adventures\r\nThe Sims 3: High-End Loft Stuff\r\nThe Sims 3: Ambitions\r\nThe Sims 3: Fast Lane Stuff\r\nThe Sims 3: Late Night\r\nThe Sims 3: Outdoor Living Stuff\r\nThe Sims 3: Generations\r\nThe Sims 3: Town Life Stuff\r\nThe Sims 3: Pets\r\nThe Sims 3: Master Suite\r\nThe Sims 3: Showtime\r\nThe Sims 3: Katy Perry's Sweet Treats Stuff\r\nThe Sims 3: Diesel Stuff\r\nThe Sims 3: Supernatural\r\nThe Sims 3: Seasons\r\nThe Sims 3: 70's, 80's &amp; 90's Stuff\r\nThe Sims 3: University Life\r\nThe Sims 3: Island Paradise\r\nThe Sims 3: Movie Stuff\r\nThe Sims 3: Into the Future\r\n\r\n\r\n** This Sims 3 install has been patched to 1.63, however included in the patch folder in the root you will find a patcher that I have designed that will patch the game to the newest patch as of compiling this package. It will also install the proper crack to get it working. This is not required to play.\r\n\r\n*** Since the game is pre-cracked, trying to patch the game from the Launcher may break the game install, so try not to do it, or you may have to re-install the game in its entirety.\r\n\r\nIf you like manually patching, you will find (TS3W.exe.ORIG &amp; TSLHost.dll.ORIG) in the The Sims 3GameBin folder. You just need to restore these two files before installing the patch manually, you can then crack it. I would save the new pre-cracked, post patched files in case you want to patch it later, the EA patches will not install over any cracked files.\r\n\r\n\r\nAlthough this installer will take the brunt of the work out of installing there are a few things to remember.\r\n\r\nThere is over 90GB of install files packed into a 25GB install. That means its not magically going to make the install a lot faster.\r\n\r\nIt will be faster than installing each part separately, plopping in the key, patching, and waiting, but its still going to take a while. So please be patient with it.\r\n\r\nI've utilized archiving with 7zip to pack everything as tightly as possible to make the install as small as I possibly could.\r\n\r\nThis installer is 99% automated. That means aside from a few clicks to get it started, once the copy process has started, the rest is fully automated and you can go grab some lunch or watch a movie or something. When you return it will be all set.\r\n\r\n**** So it's important to know that for some reason this installer cannot handle UNC Paths, or mapped drives properly. Don't try to install from either, or your install will fail big time. To ensure this does not happen, I've coded a check that should detect when the installer is running from a network and abort.\r\n\r\n***** Tested and working on all of the following operating systems:\r\n\r\nWindows XP\r\nWindows XP 64-bit\r\nWindows Vista\r\nWindows Vista 64-bit\r\nWindows 7\r\nWindows 7 64-bit\r\nWindows 8\r\nWindows 8 64-bit\r\nWindows 8.1\r\nWindows 8.1 64-bit\r\n\r\nThe Sims 3 require several prerequisites be installed in order to play, I've included them as part of the installation process. For example, on Windows 8 and 8.1 .NET Framework 3.5 is not included, however it is required by the Launcher, if its not installed it will fail. I've built a special installer that will detect when the operating system is Windows 8 or 8.1 x86 or x64 and install the proper packages.\r\n\r\n\r\nBefore starting the installation, you should remove any previous installation of The Sims 3, including any expansion packs. I have not tested what would happen if you have them installed, so I'm not responsible if anything breaks.\r\n\r\n\r\n1. Run the Sims3Setup.exe.\r\n2. Follow the dialogs clicking next as required.\r\n3. Wait... Wait some more...\r\n4. Click the Sims3 shortcut on the desktop to run the game. (optionally, first update the game with the included patcher)\r\n\r\nNOTE: I've included both a shortcut for the game that opens the launcher, and one that goes directly into the game. You will need to use the launcher anytime you want to install custom content into your game, otherwise it is faster to use the direct shortcut.\r\n\r\nCompiled by jsauce","torrent":{"xt":"urn:btih:39e4d21143a3dd65f65b19aa54ffb65f78e258bf","amp;dn":"The+Sims+3+%2B+All+Expansions","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39e4d21143a3dd65f65b19aa54ffb65f78e258bf","infoHashBuffer":{"type":"Buffer","data":[57,228,210,17,67,163,221,101,246,91,25,170,84,255,182,95,120,226,88,191]},"announce":[],"urlList":[]}}