{"title":"Pettersson- Sym 3, 4- Francis, Saarbrucken RSO 1994 [Philidor]","uid":15447316,"size":283941805,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:42474e635c1d26dbc9b413adcf4315788859aeab&amp;dn=Pettersson-+Sym+3%2C+4-+Francis%2C+Saarbrucken+RSO+1994+%5BPhilidor%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Philidor","files":24,"time":1469903255,"description":"Allan Pettersson is now considered one of the most important Swedish composers of the 20th century. In his lifetime, he had several champions but stood outside the musical mainstream, with his large-scaled, expressively grim scores. A Honegger pupil, his life wasn't easy: a violent, alcoholic father, and a mid-life diagnosis of crippling arthritis. Still, he continued composing to the end. His entire symphonic legacy--effectively 15, since the first and seventeenth were unfinished--have now been recorded complete, though a few have multiple recordings to their credit.\r\n\r\nPettersson's 13th Symphony took shape during a time when his fortunes were improving. He'd been granted a solid financial prize, the Kurt Atterberg Award, and the commission of this symphony involved a payment actually two-and-a-half times as great. He would shortly be offered a free apartment by the Swedish government, but while working on this piece still had to suffer in a cramped fourth floor apartment where, confined largely to a wheelchair, he couldn't get out, and where there was no soundproofing to exclude the endless daily construction nearby and the loud pop music of his many neighbors at night. Some of that frustration may have filtered into this work, one of his thorniest and most complex.\r\n\r\nTransfers are made at 768 kBits/s, directly from the disc.\r\n\r\nBio enclosed. You can find all my classical uploads by searching on Philidor, or just looking in this regularly updated thread:\r\n \nhttps://pirates-forum.org/Thread-Philidor-s-uploads--63895","torrent":{"xt":"urn:btih:42474e635c1d26dbc9b413adcf4315788859aeab","amp;dn":"Pettersson-+Sym+3%2C+4-+Francis%2C+Saarbrucken+RSO+1994+%5BPhilidor%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42474e635c1d26dbc9b413adcf4315788859aeab","infoHashBuffer":{"type":"Buffer","data":[66,71,78,99,92,29,38,219,201,180,19,173,207,67,21,120,136,89,174,171]},"announce":[],"urlList":[]}}