{"title":"Rush Limbaugh - July 8, 2016 Full Podcast.mp3","uid":15250483,"size":267811663,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:48bd8e1fdb782f31682530a80dfb7d5cf9d8c584&amp;dn=Rush+Limbaugh+-+July+8%2C+2016+Full+Podcast.mp3&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1468044265,"description":"Rush Limbaugh July 8, 2016 full Podcast mp3\r\n\r\nHeather Mac Donald Talks About Her Essential Book: The War on Cops\r\n\r\nHillary Is By No Means Out of the Woods, as Congressman Will Hurd's Grilling of FBI Director Comey Demonstrated\r\n\r\nRUSH:  I thought it was like 95% trusted it.  I thought the newspeople got on their Fakebook and other feeds on social media and they were gospel to them.  Only 5% trust it.  That's tough to believe.\r\n\r\n\r\nThe Left Politicizes Violence Like We've Seen This Week to Advance Their Agenda Against Conservatives, Republicans, Guns -- and Even Donald Trump!\r\n\r\nRUSH: Every time a militant Islamist terrorist shoots somebody up, what does Obama do and the Democrats?  They come out and they demand that there be no backlash against Muslims.  Okay.  So any time a police officer shoots a black suspect -- without knowing why, without knowing the circumstances -- why doesn't Obama stand up and warn against a backlash against cops?  If we are to guard against backlash against Muslim shooters, where is the sameness? Where is the equality, fairness, what have you?  It's a good point.  I don't think I've ever heard anybody in this Regime counsel restraint and advise, &quot;No backlash against cops. We must maintain the order.&quot;  \r\n\r\nJust Wait for the Conventions, Because This Violence Is Not Over\r\n\r\nRUSH: Folks, it wouldn't matter who the nominee is. It could be Trump. It could be Jeb Bush. It doesn't matter. Just keep a sharp eye. It's just going to be a couple of weeks here. And I would love to be wrong about it. Do not misunderstand here. I'm not one of these people predicting this, hoping it does happen\r\n \nhttp://www.rushlimbaugh.com/\r\n","torrent":{"xt":"urn:btih:48bd8e1fdb782f31682530a80dfb7d5cf9d8c584","amp;dn":"Rush+Limbaugh+-+July+8%2C+2016+Full+Podcast.mp3","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48bd8e1fdb782f31682530a80dfb7d5cf9d8c584","infoHashBuffer":{"type":"Buffer","data":[72,189,142,31,219,120,47,49,104,37,48,168,13,251,125,92,249,216,197,132]},"announce":[],"urlList":[]}}