{"title":"The-Laura-Ingraham-Show-Podcast JULY 6 2016","uid":15231867,"size":34923122,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:4d66433695f180594e5e417553856814d4de8ca4&amp;dn=The-Laura-Ingraham-Show-Podcast+JULY+6+2016&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1467835330,"description":"Laura Ingraham Podcast July 6, 2016\r\n\r\n Hillary Clinton Should Not Be Above the Law\r\nTime - Rand Paul\r\nIt is said-and most of us have spent our lives believing-that we are a nation of laws. If the FBI's decision to not prosecute Hillary Clinton is accepted, we will have become a nation of two sets of laws: one for the Clintons, and one for everyone else.\r\n\r\n Jim Comey's Clinton Standard\r\nWall Street Journal - Review and Outlook\r\nFor our money, the most revealing words in FBI Director James Comey's statement Tuesday explaining his decision not to recommend prosecuting Hillary Clinton for mishandling classified information were these: &quot;This is not to suggest that in similar circumstances, a person who engaged in this activity would face no consequences. To the contrary, those individuals are often subject to security or administrative sanctions.&quot;\r\n\r\n\r\n Did Comey Destroy Clinton by &quot;Exonerating&quot; Her?\r\nPJ Media - Roger L. Simon\r\nI may be alone in saying this, but when the proverbial dust settles, James Comey may have hurt Hillary Clinton more than he helped her in his statement Tuesday concerning the Grand Email Controversy. He may have let her off the hook legally, but personally he has left the putative Democratic candidate scarred almost beyond recognition.\r\n\r\n Good News for Hillary Clinton on Email Server Also Has a Downside\r\nHillary Clinton had both the best and worst day of her campaign on Tuesday, when the F.B.I. director, James B. Comey, held an extraordinary news conference to criticize her handling of her email system as secretary of state, and to say that he did not recommend federal charges against her.\r\n\r\n FBI: Clinton 'extremely careless' but no charges recommended\r\nFBI Director James Comey said Tuesday that he would not recommend charges against Hillary Clinton over her use of private email servers while secretary of state, removing a huge shadow hovering over her presidential campaign.\r\n\r\n\r\n    Chris Farrell - Director of Investigations &amp; Research at Judicial Watch.\r\n    James Kallstrom - Former Assistant FBI Director\r\n    Joe DiGenova - Former U.S. Attorney and founding partner of the law firm diGenova &amp; Toensing in Washington, DC.\r\n    Dr. Michele Borba - Psychologist &amp; Parenting Expert; Author of UnSelfie\r\n \nhttp://www.lauraingraham.com/","torrent":{"xt":"urn:btih:4d66433695f180594e5e417553856814d4de8ca4","amp;dn":"The-Laura-Ingraham-Show-Podcast+JULY+6+2016","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d66433695f180594e5e417553856814d4de8ca4","infoHashBuffer":{"type":"Buffer","data":[77,102,67,54,149,241,128,89,78,94,65,117,83,133,104,20,212,222,140,164]},"announce":[],"urlList":[]}}