{"title":"secret principles usa","uid":15230696,"size":28270318,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:581e5a1def0b796d5cad1aa057beb8af59ba9f22&amp;dn=secret+principles+usa&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":2,"time":1467818702,"description":"Coast to Coast July 6, 2016\r\nSacred Principles &amp; USA\r\n\r\nStephen Dinan, is the CEO of The Shift Network and also directed and helped to create the Esalen Institute's Center for Theory &amp; Research. In the first half, he discussed his plan for helping America grow beyond its current challenges and lead the world toward peace, sustainability, health, and prosperity by promoting a return to the sacred principles cherished by America's forefathers. The planet is shifting to a new paradigm for understanding reality and society, a more sacred worldview that includes spiritual teachers, enlightened businesses, holistic health and plant medicine, he detailed.\r\n\r\nHe suggested proposals to combat the &quot;toxic political culture&quot; in which the left and right have taken opposite stances, creating a warlike, polarized environment. For instance, by raising the minimum wage (a goal of the left), you can decrease the size of government and tax burdens, while increasing personal responsibility-- priorities of the right, he cited. Dinan also mentioned #cut50, a bipartisan initiative to reduce America's prison population by 50%, and the idea to dissolve the Federal Reserve and move to state-owned banks, which is being successfully done in North Dakota. Further, he recommended &quot;Solutions Councils,&quot; grassroots groups that collaborate with government to discover and replicate innovative programs around the world.\r\n \nhttp://www.coasttocoastam.com/guest/dinan-stephen/80517\r\n \nhttp://www.coasttocoastam.com/show/2016/07/05","torrent":{"xt":"urn:btih:581e5a1def0b796d5cad1aa057beb8af59ba9f22","amp;dn":"secret+principles+usa","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"581e5a1def0b796d5cad1aa057beb8af59ba9f22","infoHashBuffer":{"type":"Buffer","data":[88,30,90,29,239,11,121,109,92,173,26,160,87,190,184,175,89,186,159,34]},"announce":[],"urlList":[]}}