{"title":"The.Hidden.Blade.2004.BluRay.720p.x264.AAC","uid":15560176,"size":1070723472,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5d083d52575f486732972d7fa5e1c2e0ee36b041&amp;dn=The.Hidden.Blade.2004.BluRay.720p.x264.AAC&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"psaicou","files":1,"time":1471119060,"description":"During the time of change of the mid-19th Century, Yaichiro is bid farewell by his fellow samurai friends Munezo and Samon as he leaves their clan's fiefdom on the northwest coast of Japan (Unasaka) to take an important position within the shogunate in far away Edo. Munezo has lived modestly with his mother and sister Shino after his father was forced into suicide after the failure of a bridge project. Kie, a farm girl serves them as a maid in their house. As time passes, Munezo's sister marries Samon, his mother dies, Kie is married into a merchant family, and he is required to learn western methods of warfare such as the use of artillery and firearms from an official sent from Edo. Learning that Kie is ill due to abuse, he rescues her from her husband's family. Although sharing mutual affection and respect, a marriage between Munezo and Kie is still impossible due to different castes, and when he, now a bachelor, is criticized for her serving in his house, Munezo sends her back to her father's farm. After being caught in a failed political intrigue, Yaichiro is sent home in disgrace and imprisoned in solitary confinement. After Yaichiro escapes, Munezo is ordered to prove his innocence from complicity by killing his old friend, and he seeks the help of his old teacher, the sword master Kansai Toda. Although Yaichiro had been the better swordsman when they studied together, Toda entrusted the secret of the &quot;Hidden Blade&quot; only to Munezo. Toda now teaches him a new technique to use as he prepares to face Yaichiro, who has taken hostages in a farm house","torrent":{"xt":"urn:btih:5d083d52575f486732972d7fa5e1c2e0ee36b041","amp;dn":"The.Hidden.Blade.2004.BluRay.720p.x264.AAC","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d083d52575f486732972d7fa5e1c2e0ee36b041","infoHashBuffer":{"type":"Buffer","data":[93,8,61,82,87,95,72,103,50,151,45,127,165,225,194,224,238,54,176,65]},"announce":[],"urlList":[]}}