{"title":"TSPrint v2.0.6.3","uid":15727929,"size":15685573,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5d0d980f0c660bcf341c27385b8ba709bf51356a&amp;dn=+TSPrint+v2.0.6.3&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"dastar","files":1,"time":1472742144,"description":"TerminalWorks TSPrint Server v2.0.6.3\r\n\r\nINSTRUCTIONS:\r\nJust launch the installation file and you are done. \r\n\r\nTSPRINT\r\nTerminal Server Printing\r\nTSPrint is the RDP printing software for Terminal Services, Remote Desktop, VDI, or Citrix environments. Simple implementation and ease-of-use, coupled with an affordable licensing system, makes TSPrint one of the most popular remote desktop printing solutions on the market. Increase the stability of servers, without installing printer drivers on any terminal server. Clients print directly to their local printers from the terminal server, without additional administrator time required for implementation or configuration.\r\n\r\nFEATURES\r\n\r\nDRIVERLESS PRINTING\r\nThere's absolutely no need to install printer drivers on the terminal server when you install TSPrint. TSPrint includes its own virtual printer driver, which will receive the print job, compress it, and send it to the local workstation.\r\nIMPROVED PRINTING PERFORMANCE\r\nYou encounter long wait times between print jobs when using Microsoft Printer Redirection, which sends the job directly through the RDP connection, without compression. With TSPrint, our print compression technology delivers extraordinary performance.\r\n\r\nEASY AND FAST DEPLOYMENT\r\nThe TSPrint installation uses plug-and-play technology, requiring no configuration. Our installer comes with a 'silent install' option so you can deploy across your network. MSI packages are also available, with simple active directory deployment.\r\nWORKS ON ANY NETWORK\r\nTSPrint uses the Microsoft Virtual Channel technology. By using VC, TSPrint can work as long as you can connect to the terminal server. There is no need for any additional network configuration.\r\n\r\nOPEN FILES LOCALLY\r\nRight click on any document and select the 'TSPrint Open Locally' option. TSPrint transfers documents to the local workstation and opens it with the default application.\r\nTRANSFER FILES\r\nWith a simple right-click, you can transfer your file to the local workstation. The standard save dialog will show up, and you can select where on the local workstation you wish to transfer the file.\r\n\r\nNETWORK PRINTER\r\nBe able to send your print jobs on your colleagues printer. Just print to the TSPrint Network printer and you will be shown the currently logged in remote desktop users and their local available printers making it easy for you to utilize other printer devices besides the one connected to your local computer.\r\n\r\nOfficial Website: http://www.terminalworks.com/remote-desktop-printing","torrent":{"xt":"urn:btih:5d0d980f0c660bcf341c27385b8ba709bf51356a","amp;dn":"+TSPrint+v2.0.6.3","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d0d980f0c660bcf341c27385b8ba709bf51356a","infoHashBuffer":{"type":"Buffer","data":[93,13,152,15,12,102,11,207,52,28,39,56,91,139,167,9,191,81,53,106]},"announce":[],"urlList":[]}}