{"title":"RadioEINS Sommer der Legenden - Kurt Cobain (2016-08-14 720min)","uid":15570343,"size":687152078,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:676c7dbc33cf425c0efa086417a02d18b8f9d1a3&amp;dn=RadioEINS+Sommer+der+Legenden+-+Kurt+Cobain+%282016-08-14+720min%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"volatile030","files":2,"time":1471250973,"description":"Sommer der Legenden: Kurt Cobain\r\nmit Stephan Karkowsky\r\n\r\nWährend der Sommerferien 2016 findet sechs Wochen lang jeden Sonntag ein 12-Stunden-Musikprogramm statt, welches  sich jeweils um eine große musikalische Legende dreht: Amy Winehouse, David Bowie, Elvis Presley, Kurt Cobain, Prince und John Lennon - sie sind tot, aber sie kehren für einen Sommer zurück, denn Legenden sterben nie!\r\n\r\nUnsere radioeins-Serie über die großen Musiklegenden lebt von ihrer Musik, ihren großen Hits und vielen Raritäten. Natürlich aber gibt es auch zu jedem Künstler Biografisches, Archivmaterial, Anekdoten, Zahlen und Fakten. Es kommen Interviews zur Aufführung und Berichte von Zeitzeugen; Fachleute erstellen Psychogramme und Musikkritiker ordnen das jeweilige Oeuvre in den historischen Popkontext ein.\r\n\r\nAn jedem Legendensonntag geht radioeins chronologisch vor, es beginnt ab 9.00 Uhr mit der Kindheit und Jugend der Stars, der Rolle der Familie und der Frage: Durch welche Initialzündung der jeweilige Künstler zur Musik kam.\r\n \r\nÜber die frühen Aufnahmen und die ersten Erfolge nähern wir uns dem Weltruhm und den Höhepunkten der jeweiligen Karriere. Am Abend ab 18.00 Uhr wird geklärt, warum es zum oftmals verfrühten Tod kam. Der bekannte Psychologie-Professor Borwin Bandelow (Uni Göttingen) wird auf radioeins u.a. erklären, wieso sich Elvis zu Tode gegessen hat und Kurt Cobain freiwillig mit 27 aus dem Leben geschieden ist. Und am Ende eines jeden Sonntags wissen wir, warum Amy, Kurt, John, Elvis, Prince und David zu großen musikalischen Legenden geworden sind","torrent":{"xt":"urn:btih:676c7dbc33cf425c0efa086417a02d18b8f9d1a3","amp;dn":"RadioEINS+Sommer+der+Legenden+-+Kurt+Cobain+%282016-08-14+720min%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"676c7dbc33cf425c0efa086417a02d18b8f9d1a3","infoHashBuffer":{"type":"Buffer","data":[103,108,125,188,51,207,66,92,14,250,8,100,23,160,45,24,184,249,209,163]},"announce":[],"urlList":[]}}