{"title":"[Clips4sale] Fifi Foxx - Bonding Exercise with My New Young Step","uid":15229189,"size":578860977,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:6e4aee76becdf7cb277c71cc4737057e450579be&amp;dn=%5BClips4sale%5D+Fifi+Foxx+-+Bonding+Exercise+with+My+New+Young+Step&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"enterdrone","files":1,"time":1467802982,"description":"FILEINFO\r\n\r\nPrelude: Aiden is skeptical about the new woman his dad has fallen for. It seemed like just a few months ago that they met, and now they're already married! There's no way a woman so young could possibly be interested in his dad, unless of course, it's for money. He struggles, finding his new stepmom attractive, and tries to dodge her anytime he can. Aiden is bitter towards her, rejecting the idea that this woman is now a part of his family.\r\n\r\nScene (story, POV): It's a school day, and Aiden has morning wood. Since he's up earlier than usual, he decides he has enough time to jerk off and unload. He looks to his left, making sure his tissues and lotion are within reach, and begins jerking off. Only a few seconds in, he hears his stepmom from outside his room, &quot;AH, FUCK, FUCK, FUCK! Oh god, I over slept again!&quot; She knocks on his door, &quot;Aiden, are you up?... Aiden, are you up?... Okay, honey, well I can't hear you, so I'm coming in, okay?... Make sure you're dressed.&quot; He panics, telling her no, and without enough time to pull up his pants, he covers himself with a nearby pillow. His stepmom comes in, yawning and stretching, still trying to wake up for the day, &quot;Oh, honey, good morning. I'm sorry. My alarm went off, and I guess I didn't hear it. Oh, I was up late last night, but I'm glad to see you're up.&quot;\r\n\r\nAiden is bitter and cruel for no reason, telling her to get out, and then pointing out that she's wearing his dad's shirt. &quot;Well, you're awfully grumpy this morning. I'm just trying to help out... Well, honey, I just threw this on because I knew I was late to wake you up, and it's just really comfortable. You know me and your dad are together... You always get like this.&quot; Although she's sweet, Aiden continues to fight with her, bringing it to her attention that she's 20 years younger than his dad. She smiles, &quot;No matter how old he is, I care for him, and I love him very much, okay?... Why don't you go ahead and get up, and get some breakfast?&quot;\r\n\r\nAiden tells her to get out again, and she ignores his hostility, noticing the box of tissues underneath the pillow. She asks if he has a cold, and he lies, telling her that he's been coughing all night. &quot;I didn't really hear you... Do you want me to grab some medicine for you while you're at school...?&quot; He plays along, and his stepmom looks down to find the lotion hidden as well, &quot;Oh, oh... right, right, so.. Is this, uh, is this something I should be concerned about? Um... lotion... Oh, you have dry skin? Okay, okay. I got you. I get this. Tissues, lotion, you don't want me to come in. There's gotta be something going on.&quot;\r\n\r\nShe runs to the bed, jumps up, and straddles his body. &quot;So, if, uh, you're sick, and, you know, your skin's dry, you wouldn't mind if I took this pillow off?&quot; She throws the pillow aside to reveal his cock, &quot;Oh, and there it is! I knew it. Did you want to tug one out before you went to school? You have that morning wood, huh?&quot; She touches his cock, &quot;And look, you're built just like your dad... Mmm, wow! So, here's what I'm going to do. Since you don't like me, I thought we might do a little bonding exercise, okay? Now, morning wood is nothing to be ashamed about. So, let me help you out, and maybe it'll bring us all a little bit closer... and maybe you can finally call me Mom.&quot;\r\n\r\nShe wraps her hand around Aiden's cock and strokes, &quot;See, that feels good. We're bonding, aren't we? I know you don't have very much time before school, so I figured I could help you out... Here, it seems like you're a little bit shy. I'll show you something of mine.&quot; She stops to unbutton her shirt, revealing her perky tits, and continues to stroke, twisting her hand on the shaft. &quot;See, we're growing closer already... Here, let me make my hands a little bit softer for you.&quot; She pours lotion into her hand, and spreads it around, lubricating his cock as she jerks it. &quot;Just stare at my tits... It'll help you stay hard.&quot; She jerks his cock with both of her hands at the same time, and moans, groping her chest. &quot;See, I'm not so bad. I just wanna be close with you. I'll take really good care of you.&quot;\r\n\r\nAfter a while, she adds more lotion, spreading it through her fingers, and runs it up his cock with her hands. She goes slow, then fast, &quot;Come on, honey, we don't have much time. I bet you have a huge load, just like your father does... Come on, honey, we're going to run out of time. I know you're close... Let me see you cum.&quot; Aiden erupts all over her hand, and onto himself, &quot;Look at all of that cum! See, I knew we were going to be a good little family.&quot; She reaches for the tissues, and starts to clean him off, &quot;Think you might have to put a new shirt on... But, I am going to teach you some manners right now. I want you to say 'Thank you, Mommy'... There you go. Good boy.&quot;\r\n\r\nContains the following erotic elements:\r\nTABOO - HANDJOBS\r\nCategory: TABOO\r\nRelated Categories: HANDJOBS, TABOO","torrent":{"xt":"urn:btih:6e4aee76becdf7cb277c71cc4737057e450579be","amp;dn":"%5BClips4sale%5D+Fifi+Foxx+-+Bonding+Exercise+with+My+New+Young+Step","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e4aee76becdf7cb277c71cc4737057e450579be","infoHashBuffer":{"type":"Buffer","data":[110,74,238,118,190,205,247,203,39,124,113,204,71,55,5,126,69,5,121,190]},"announce":[],"urlList":[]}}