{"title":"TaleSpin complete DVDrip 640x480 xvid AC3","uid":15431356,"size":54199675769,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6ff95029251c11500a51d153b45c0865e4d215e8&amp;dn=TaleSpin+complete+DVDrip+640x480+xvid+AC3&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"RFF","files":69,"time":1469725107,"description":"TaleSpin is a half-hour animated adventure series based in the fictional city of Cape Suzette, that first aired in 1990 as a preview on The Disney Channel and later that year as part of The Disney Afternoon, with characters adapted from Disney's 1967 animated feature The Jungle Book, which was theatrically rereleased in the summer before this show premiered in the fall. The name of the show is a play on tailspin, the rapid descent of an aircraft in a steep spiral. The two words in the show's name, tale and spin, are a way to describe telling a story.\r\n\r\nThe series centers on the adventures of bush pilot Baloo the bear, whose air cargo freight business, &quot;Baloo's Air Service&quot;, is purchased by Rebecca Cunningham upon his default on delinquent bills with the bank and renamed &quot;Higher for Hire&quot;. An orphan boy and former air pirate, the ambitious Kit Cloudkicker, attaches to Baloo and becomes his navigator. He sometimes calls him &quot;Papa Bear&quot;. Together, they are the crew of Higher for Hire's only aircraft, a 20-year-old modified Conwing L-16 (a fictitious combination of a Fairchild C-82 transport and a Grumman HU-16 amphibian) named the Sea Duck. From there, the series follows the ups and downs of Higher for Hire and its staff, sometimes in the vein of old action-adventure film serials of the 1930s and 1940s and contemporary variations, such as Raiders of the Lost Ark","torrent":{"xt":"urn:btih:6ff95029251c11500a51d153b45c0865e4d215e8","amp;dn":"TaleSpin+complete+DVDrip+640x480+xvid+AC3","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ff95029251c11500a51d153b45c0865e4d215e8","infoHashBuffer":{"type":"Buffer","data":[111,249,80,41,37,28,17,80,10,81,209,83,180,92,8,101,228,210,21,232]},"announce":[],"urlList":[]}}