{"title":"BitTorrent Pro E uTorrent Pro MAIS ATIVADORES 2016","uid":15725287,"size":163361898,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:71f55af5fec20a45db28170d50ee1aa017c6de02&amp;dn=BitTorrent+Pro+E+uTorrent+Pro+MAIS+ATIVADORES+2016&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"DIDIMORAES","files":2,"time":1472708824,"description":"Descrição: BitTorrent é um protocolo de rede que permite ao utilizador realizar downloads (descarga) de arquivos, em geral indexados em websites. Esse protocolo introduziu o conceito de partilhar o que já foi descarregado, maximizando o desempenho e possibilitando altas taxas de transferência, mesmo com um enorme número de usuários realizando descargas (downloads) de um mesmo arquivo simultaneamente. Foi criado por Bram Cohen em abril de 2001 e teve sua primeira implementação liberada no dia 2 de Julho de 2001. Desde de então tem sido alvo de empresas que lutam em defesa da propriedade intelectual, devido a alegações de violação de copyright (autoria) de alguns arquivos transmitidos pela rede. No ano de 2005 o protocolo BitTorrent foi responsável por 35% dos dados transferidos na Internet em todo o mundo.\r\n\r\nAtualizado para Versão: 7.9.8 Build 42450\r\n\r\nDescrição: O uTorrent é um dos primeiros nomes que vêm à cabeça de quem baixa arquivos da web. O programa que inovou ao oferecer um visual compacto e excelentes ferramentas que aproveitam de verdade a banda larga chega à sua terceira versão e apresenta uma série de novidades. Mantendo recursos que deram certo, como o leitor de RSS, e aderindo novidades muito interessantes, como a possibilidade de instalar aplicativos no programa (no melhor estilo extensão de navegador), o uTorrent dá sequência em sua caminhada e mostra não ser por acaso o fato de seu nome ser sinônimo de downloads rápidos.\r\n\r\nAtualizado para Versão v3","torrent":{"xt":"urn:btih:71f55af5fec20a45db28170d50ee1aa017c6de02","amp;dn":"BitTorrent+Pro+E+uTorrent+Pro+MAIS+ATIVADORES+2016","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71f55af5fec20a45db28170d50ee1aa017c6de02","infoHashBuffer":{"type":"Buffer","data":[113,245,90,245,254,194,10,69,219,40,23,13,80,238,26,160,23,198,222,2]},"announce":[],"urlList":[]}}