{"title":"The-Laura-Ingraham-Show-Podcast Aug 30","uid":15713165,"size":34601292,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:73dfb6c60a7700718043e251f17d7ca6a7aa5162&amp;dn=The-Laura-Ingraham-Show-Podcast+Aug+30&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1472599066,"description":"Laura Ingraham August 30, 2016 Podcast\r\namerican talk radio conservative\r\n\r\nSowell: 'Welcomes Trump For Reaching Out To African Americans; The NAACP Doesn't Own The Black Community' \r\nGuest Lineup\r\nMichael Steele - Former Republican National Committee Chairman, MSNBC political analyst.\r\nPat Buchanan - Former senior advisor to Presidents Nixon, Ford, and Reagan, political commentator, and author.\r\nThomas Sowell - Senior Fellow on Public Policy at the Hoover Institution, author of Wealth, Poverty, and Politics.\r\n\r\nBlack Lives Matter to Donald Trump\r\nHeather Mac Donald - Wall Street Journal\r\nHillary Clinton tried to tar Donald Trump as a racist last week by associating him with the &quot;alt-right.&quot; Yet it is Mr. Trump who has decried the loss of black life to violent crime-and has promptly been declared biased for doing so. Whether intentionally or not, Mr. Trump has exposed the hypocrisy of the Black Lives Matter movement and its allies.\r\nMedia donates to Clinton Foundation, then downplays the Foundation's scandal\r\nHillary Clinton and her media allies have been working overtime to put out numerous fires that continue to pop up and spread during the final weeks of her campaign for president. Recently, the flames have gotten more difficult to smother as reports of Clinton's frail health have bled into the mainstream media, despite the unanimous and unilateral decision by the MSM to treat anyone who even raises a question as akin to a Holocaust denier. (On Sunday night, for example, Huffington Post fired contributor David Seaman and deleted his columns simply for linking to a Hillary health video that's been viewed four million times.)","torrent":{"xt":"urn:btih:73dfb6c60a7700718043e251f17d7ca6a7aa5162","amp;dn":"The-Laura-Ingraham-Show-Podcast+Aug+30","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73dfb6c60a7700718043e251f17d7ca6a7aa5162","infoHashBuffer":{"type":"Buffer","data":[115,223,182,198,10,119,0,113,128,67,226,81,241,125,124,166,167,170,81,98]},"announce":[],"urlList":[]}}