{"title":"[GirlsWay] - Dahlia Sky, Samantha Hayes - Clairvoyance Part Two","uid":15437131,"size":517045686,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:77415359754b44bd89c6942a84954cb5ea589d1f&amp;dn=%5BGirlsWay%5D+-+Dahlia+Sky%2C+Samantha+Hayes+-+Clairvoyance+Part+Two+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"LucasCar","files":1,"time":1469773358,"description":"[GirlsWay] - Dahlia Sky, Samantha Hayes - Clairvoyance Part Two [NEW July 28, 2016] \r\n\r\n Dahliaâ™s story about Charlotte and the binding spell leaves Samantha dumbfounded. Sure, she seeâ™s ghosts but to believe that magic exists is beyond her ability. Dahlia is eager to show the hypocrite Samantha that Magic is real, so instead of battling over whether magic is real or not, Dahlia leans forward and heals Samanthaâ™s hurt leg. Samantha is astonished, but when she notices that Dahlia is weakened, sheâ™s surprised to hear that magic comes with a cost. That nothing comes from nothing. Dahlia explains that Charlotte is waiting for them and that she needs Samanthaâ™s power to see the dead in order to communicate. Dahlia rushes to get on the flight to Utah to make contact, but nearly forgets how weak she is and tumbles. Samantha suggests they sleep of the magic and go tomorrow, but Dahlia is adamant that Charlotte has been waiting too long. Samantha asks if thereâ™s another way, and Dahlia leans in to kiss her passionately. Samantha is taken aback by her forwardness, seeing as Charlotte is her soul mate. Dahlia explains that sex magic has the power to heal and Samanthaâ™s longer has any issues. Dahlia leans in again to plant a kiss on Samantha, slowly gaining her strength. They move to the bedroom as things heat up and before long Samanthaâ™s top is off, and Dahlia is worshiping her soft untouched body. They writhe their lesbian bodies together as they make out, and soon, Dahliaâ™s hunger for Samanthaâ™s naive pussy leads her to eat her sweet pussy out. They trib as they get closer and closer to their lesbian orgasms. Samantha finally gets a chance to taste Dahliaâ™s sweet divine pussy, using her tongue piercing to stimulate Dahliaâ™s clit with the lust sheâ™s had pent up all these years. In 69 they inch closer to their orgasms, feeling the energy run through their bodies in a cycle from mouth to pussy until they both cum, screaming at the top of their lesbian lungs.\r\n \nhttp://screenimage.net/img-579ada0db784f.html\r\n \nhttp://screenimage.net/img-579ada18bcc90.html\r\n\r\n\r\n\r\n★ ★ ★  For more Exclusive Porn please visit ★ ★ ★\r\n  \nhttps://thepiratebay.org/user/LucasCar","torrent":{"xt":"urn:btih:77415359754b44bd89c6942a84954cb5ea589d1f","amp;dn":"%5BGirlsWay%5D+-+Dahlia+Sky%2C+Samantha+Hayes+-+Clairvoyance+Part+Two+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77415359754b44bd89c6942a84954cb5ea589d1f","infoHashBuffer":{"type":"Buffer","data":[119,65,83,89,117,75,68,189,137,198,148,42,132,149,76,181,234,88,157,31]},"announce":[],"urlList":[]}}