{"title":"Hidden Secrets - Part 158 - UFOs Angels Nephilim Spirits Witches","uid":15435189,"size":8352611484,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:783351d60ac4a944e6546d5b6b7b12d41efe669a&amp;dn=Hidden+Secrets+-+Part+158+-+UFOs+Angels+Nephilim+Spirits+Witches&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":99,"time":1469753543,"description":"Hidden Secrets - Part 158 - UFOs Angels Nephilim Spirits Witches\r\n\r\nDownloader's Notes:\r\nWith over 20+ mp3 sessions, some may sound familar but you should find new material as well.  As a former Police Officer turned Preacher, Russ Dizdar has many encounters with various underworld figures.  He discusses the Illuminati, NWO, the Occult, Psychics, Super Soldiers/Assassins, Free Masonry, among others and unveils how they are collectively working towards fulfilling their own Satanic End Times Prophecy.  I will say this, Russ Dizdar definetly puts a new spin on things from what you normally hear about in the NWO and its relationship with Satanic practices in society and local communities.  Although he uncovers much, he is just scratching the surface.  Using their Demonic Phsychic abilities these followers invade the thoughts of unsuspecting children of God, young and old, via invoking evil thoughts, feelings and even possesions.  Their Mind Control depends on the victims' awareness of their own thoughts/inner voice over that of an outsider's and willingness to give into their perversions or ability to recognize and fight against their abuse through prayer and self-control.  Unfortunately while Russ discusses the use of &quot;Handlers&quot;, he does not delve much into the true Dark Powered Ones running behind the scenes.  Those with these abilities that live in virually every community, like John or Jane Doe next door, that outwordly go about a seemingly normal life among us casual observers giving no indication of who or how evil they are or how to spot them.  However, if you are not up-to-date on what's happening in the NWO's Satanic worship, and how it relates to your community, this is definetly for you!\r\n\r\nThe depth of discussions also include; \r\nNew Age teachings, Mind Control, The Black Awakening, Alistair Crowley, Svali Ex-Illuminati, David Icke, Ascended Masters, Nephilim, Arizona Wilder, Occult Methods and Transhumanism amongst other things. As always Russ gives a deep insight with 30 yrs experience behind him he has a deep understanding of the Darkside system and purpose","torrent":{"xt":"urn:btih:783351d60ac4a944e6546d5b6b7b12d41efe669a","amp;dn":"Hidden+Secrets+-+Part+158+-+UFOs+Angels+Nephilim+Spirits+Witches","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"783351d60ac4a944e6546d5b6b7b12d41efe669a","infoHashBuffer":{"type":"Buffer","data":[120,51,81,214,10,196,169,68,230,84,109,91,107,123,18,212,30,254,102,154]},"announce":[],"urlList":[]}}