{"title":"Busnois etc - Masses - Kirkman, cond; Binchois Cnsrt (Philidor]","uid":15751407,"size":362570019,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:79ffd9da0e804d1470267adaba6d058009c33155&amp;dn=Busnois+etc+-+Masses+-+Kirkman%2C+cond%3B+Binchois+Cnsrt+%28Philidor%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Philidor","files":19,"time":1473034104,"description":"Per the Hyperion website:\r\n\r\nThe French composer, singer and poet Busnois was widely acknowledged as one of the most outstanding composers of his time, and his Missa L'homme armé (circa 1460) was one of the most revered works of the later fifteenth century. Origins of the famous tune on which it is based are somewhat unclear, but many believe it was composed by Busnois himself. His was definitely one of the first (if not the first) Masses to be composed on this tune, and another 40 or so were written subsequently by various composers of various nationalities. In fact, many of Busnois' works inspired emulations, and the other two works on this disc by him are equally mesmerising and exhilarating.\r\n\r\nThe Franco-Flemish composer Domarto also enjoyed considerable international repute in the mid-to-late fifteenth century, largely due to the popularity of the work by him presented on this disc.\r\n\r\nWe have therefore, together with Jean Pullois’ inspiring motet Flos de spina, a disc of some of the most important choral works from the fifteenth century, expertly and beautifully performed by one of the country’s leading exponents in this field, namely the Gramophone award-winning Binchois Consort","torrent":{"xt":"urn:btih:79ffd9da0e804d1470267adaba6d058009c33155","amp;dn":"Busnois+etc+-+Masses+-+Kirkman%2C+cond%3B+Binchois+Cnsrt+%28Philidor%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79ffd9da0e804d1470267adaba6d058009c33155","infoHashBuffer":{"type":"Buffer","data":[121,255,217,218,14,128,77,20,112,38,122,218,186,109,5,128,9,195,49,85]},"announce":[],"urlList":[]}}