{"title":"Windows 10 RTM-Escrow Insider Preview_x64_Enterprise_1607_1483","uid":15242597,"size":3905778721,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7c989f80665c00a98f138968b489b7b33e20bacb&amp;dn=Windows+10+RTM-Escrow+Insider+Preview_x64_Enterprise_1607_1483&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Strat79","files":5,"time":1467969699,"description":"Windows 10 Redstone RTM-Escrow Insider Preview Enterprise x64 v.1607_14383 En-us Untouched ISO\r\n\r\n\r\nThis is the RTM version for the Enterprise Insider Preview fast ring. It is the precursor to the final Anniversary Build coming very soon.\r\n\r\nUntouched ISO made from the update ESD. English only.\r\nNothing added/nothing deleted. I'm only uploading ENTERPRISE editions from now on since that is all I'm using now.\r\n\r\nThis was created by using the update.esd file and using an ESD Decrypter to create the .iso choosing the &quot;Standard install.wim&quot; not the compressed one and mine are all Enterprise editions(which are typically bigger), which is why the size is larger than some others. They probably used the compressed .esd and maybe even took out some bloat. I do this for people that want one that hasn't been altered in any way whatsoever. It has no frills, nothing added nor nothing changed. Just check the box that says you do not have a key then you have 3 days to use whatever method you want to activate.\r\n\r\nMicrosoft Toolkit 2.6 Beta 5 is included for activation but you can use any other method as well.\r\n\r\nInstall Notes\r\n\r\n1: Use Rufus to create a bootable .iso from the image &quot;en_windows_10_enterprise_14383_x64_dvd.iso&quot; onto a thumbdrive or use any DVD authoring software capable of creating a bootable .iso from the &quot;en_windows_10_enterprise_14383_x64_dvd.iso&quot; file.\r\n2: You may have to change your first boot device to the thumdrive or DVD drive in your BIOS/UEFI.\r\n3: When asked for a key just check the box that says &quot;I do not have a key&quot; and it will continue the installation.\r\n4: You then have 3 days to activate using whichever method you choose. I have included the &quot;Microsoft Toolkit 2.6 Beta 5.exe&quot; in the &quot;Activator&quot; folder but you can use any activation method of your choice.\r\n5: If you choose to use the Microsoft Toolkit, run it as administrator and click the Windows Colored Flag in the bottom right corner right next to the &quot;Settings&quot; button.\r\n6: Click the &quot;Activation&quot; tab and leave the drop down box as &quot;AutoKMS&quot; and click the &quot;Install&quot; button. It may take a few seconds or a couple minutes. Once it says complete, click the &quot;EZ-Activator&quot; button and let it finish.\r\n\r\nYou will then be activated. This tool can be used to activate almost all versions of Office as well by clicking the other button in the bottom right","torrent":{"xt":"urn:btih:7c989f80665c00a98f138968b489b7b33e20bacb","amp;dn":"Windows+10+RTM-Escrow+Insider+Preview_x64_Enterprise_1607_1483","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c989f80665c00a98f138968b489b7b33e20bacb","infoHashBuffer":{"type":"Buffer","data":[124,152,159,128,102,92,0,169,143,19,137,104,180,137,183,179,62,32,186,203]},"announce":[],"urlList":[]}}