{"title":"Blue Bloods - Seasons 6 Episodes - 12 to 22","uid":15559536,"size":4737653249,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7caf538bdd4e53878497313bfb41fafda01776a2&amp;dn=Blue+Bloods+-+Seasons+6+Episodes+-+12+to+22&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":31,"time":1471109716,"description":"Description\r\n\r\nBlue Bloods - Season 6 Episodes - 12 to 22\r\n\r\nThe series follows the Reagan family of police officers with the New York City Police Department (NYPD). Francis Xavier &quot;Frank&quot; Reagan is the Police Commissioner. Frank's oldest son Danny is a NYPD detective, his youngest son Jamie is a NYPD police officer, and his daughter Erin is the assistant district attorney. Frank's middle son Joe was murdered in the line of duty in events that pre-date the series, when he was involved with the Federal Bureau of Investigation (FBI) investigating a group of corrupt NYPD cops. Frank's father Henry is a former NYPD beat cop who rose through the ranks to Police Commissioner.\r\n\r\nBoth Henry and Frank's wives are deceased. Erin is divorced and has one teenaged daughter, Nicky, who lives with her. Danny is married to Linda, an ER nurse, and they have two sons, Jack and Sean. Jamie is unmarried.\r\n\r\nA show signature is the Sunday dinner scene around the large table in Frank and Henry's home. The four generations of Reagans gather to eat and discuss their week, which naturally includes current cases or controversies depicted in each episode. The grandchildren often have meaty or moral issue questions which the various adults answer, sometimes with differing viewpoints. The conversation may also include family members ribbing each other, and Henry or Frank dispensing wise advice. Sometimes the conversation breaks down in acrimony because of differing feelings or perspectives among family members on emotional issues, but the family always remains loving and united.\r\n\r\nA running theme through the first season is Jamie's assumption of Joe's investigation. The FBI tried to recruit Jamie, but he instead conducted his own covert investigation into Joe's death. The corrupt cops were operating within a fraternal organization called the &quot;Blue Templar&quot;. The dirty cops murdered Joe when his covert investigation was getting close to naming names. Joe's murderers try to kill Jamie by tampering with the brakes on his car, but fail. After the failed hit, Jamie informs Frank, Danny, and grandfather Henry about the results of his informal investigation. Along with his prosecutor sister Erin, the Reagan family joins together and completes Joe's Blue Templar investigation. After gathering sufficient evidence to obtain arrest warrants, Frank leads a team of police officers, including Danny and Jamie, to execute the warrant. They arrest the corrupt cops while they are having a covert meeting to divide stolen drug money. The group's leader, a detective named Sonny Malevsky, admits to killing Joe Reagan. After his confession, Malevsky commits suicide with his service pistol","torrent":{"xt":"urn:btih:7caf538bdd4e53878497313bfb41fafda01776a2","amp;dn":"Blue+Bloods+-+Seasons+6+Episodes+-+12+to+22","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7caf538bdd4e53878497313bfb41fafda01776a2","infoHashBuffer":{"type":"Buffer","data":[124,175,83,139,221,78,83,135,132,151,49,59,251,65,250,253,160,23,118,162]},"announce":[],"urlList":[]}}