{"title":"Goodbye Marilyn 2","uid":15274913,"size":653695398,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:7d81d9a250d263b661c5f47dc574a5bb39c16954&amp;dn=Goodbye+Marilyn+2&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"hunter534","files":1,"time":1468292470,"description":"Applaus schallt aus der Stadt. Im Showgirl-Club gibt es eine neue Attraktion - Teko, eine vollbusige, brasilianische Feuerbraut, begeistert mit ihrem Huftschwung das Publikum. Die Kerle sind ihr reihenweise verfallen, auch Party-Konig Markus Egger. Marilyn, alias Julie Hunter, ist uberzeugt, dass Markus sie nicht noch einmal betrugt. Doch sie wird eines Besseren belehrt. Schamlos und vom Trieb gesteuert vogelt der Boss nicht nur das neue Showgirl - auch Rotschopf Ashley, die neue Tresenkraft, fuhrt ein au?erst intimes Bewerbungsgesprach mit dem sexsuchtigen Herrn auf der Toilette. Die Geldmaschine und geliebte Marilyn ist nur noch das Dummchen. Ende des Traums! Willkommen in der Realitat! Der Star sturzt ab. An der Bar lasst sich Marylin volllaufen, irrt schlupferlos im Vollrausch durch die Nacht und ist total breit auf der Buhne - ein Desaster. Doch im Netz ist der Absturz ein Erfolg-2 Millionen Klicks. Die Show geht weiter! Kim XXX, ein neues Girl, ein laszives, asiatisches Flittchen, avanciert zum Star des Showgirls-Club.Braucht Markus unsere Heldin nicht mehr? Marilyn sinnt auf Rache. Auch ihr juckt es zwischen den Schenkeln. Eiskalt verfuhrt sie Buchhalter Konrad und erreicht ihr erstes Reiseziel, einen Geldtransfer. 200.000,- Euro wechseln den Besitzer. Seid gespannt wie es weitergeht und freut Euch auf den dritten Teil dieses faszinierenden, erotischen Meisterwerkes!\r\n\r\nCast: Feature, Busty, Cumshots/Sperm, Hardcore, All Sex\r\n\r\nCOVER+SCEENSHOT:\r\n \nhttp://photo-up.info/img-57844131519ec.html \r\n \nhttp://photo-up.info/img-5784413b8ee29.html","torrent":{"xt":"urn:btih:7d81d9a250d263b661c5f47dc574a5bb39c16954","amp;dn":"Goodbye+Marilyn+2","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d81d9a250d263b661c5f47dc574a5bb39c16954","infoHashBuffer":{"type":"Buffer","data":[125,129,217,162,80,210,99,182,97,197,244,125,197,116,165,187,57,193,105,84]},"announce":[],"urlList":[]}}