{"title":"Beavis and Butt-Head Season 1-7 MP4 Ripped from King Turd","uid":15700843,"size":17153651931,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7e94f271bf457d719d3e60d28367edcd96fc8d5f&amp;dn=Beavis+and+Butt-Head+Season+1-7+MP4+Ripped+from+King+Turd&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"BBCoool","files":196,"time":1472476630,"description":"If you're reading this, thank you for downloading and please SEED!\r\n\r\nThis is the complete Beavis and Butt-Head collection from Season 1-7 with music videos and properly ordered and ripped from the King Turd collection.\r\n\r\nThis is the best quality of Beavis and Butt-Head you're going to find in a complete torrent in a useful file format (MP4).\r\n\r\n\r\nThis torrent was created for members of /r/beavisandbutthead and wouldn't have been created without their expressed interest.\r\n\r\nThis torrent was created based on the King Turd collection, ripped from that collection into .MP4 format at a constant quality setting on Handbrake to give the best converted quality I could at a decent size.\r\n\r\nThe quality of videos in this torrent is at the best I could possible achieve and the best I have seen today. They are a mixture of old rips and collections built together from King Turd. I've just simplified everything into a better format, file-size and proper organizing.\r\n\r\nThe King Turd collection has many improperly organized episodes ranging into different numbers and different seasons.\r\n\r\nThis was created to give the best overall collection in a fairly good file-size in a format universally excepted.\r\n\r\nMany of my friends have issues with the .MKV container and don't have the time or knowledge in converting excessive amounts of files into different formats.\r\n\r\nMany thanks goes out to King Turd for the brilliant work in getting the original collection together, this just simplifies everything.\r\n\r\nI hope you enjoy, dudes","torrent":{"xt":"urn:btih:7e94f271bf457d719d3e60d28367edcd96fc8d5f","amp;dn":"Beavis+and+Butt-Head+Season+1-7+MP4+Ripped+from+King+Turd","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e94f271bf457d719d3e60d28367edcd96fc8d5f","infoHashBuffer":{"type":"Buffer","data":[126,148,242,113,191,69,125,113,157,62,96,210,131,103,237,205,150,252,141,95]},"announce":[],"urlList":[]}}