{"title":"Chirality from Dynamic Kinetic Resolution","uid":15454113,"size":22624509,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:83bd3bc06dd6216c73cd58b3b0ac14ecf534fb29&amp;dn=Chirality+from+Dynamic+Kinetic+Resolution&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clouderone","files":1,"time":1469967539,"description":"Chirality from Dynamic Kinetic Resolution - HeÌleÌ€ne Pellissier (RSC, 2011).pdf\r\n\r\nThe last 15 years have witnessed significant developments in the efficiency and scope of the application of DKR. These now offer a serious alternative to conventional methods for asymmetric synthesis. Indeed, impressive examples using new enzymes and major progress in the DKR of racemates have taken place over the past few years. The powerful combination of enzymes and metals has also been the subject of spectacular development. In addition, a new type of DKR, involving organocatalysts, has recently appeared. Although asymmetric catalysis has undergone development during the last two decades, the most common industrial process used to obtain enantiomerically pure compounds is still via resolution of racemic mixtures. This is despite the major disadvantage that only a maximum of 50% product yield can be obtained. It is not surprising that DKR, which solves the problem of the limitation in yield, has attracted an increasing amount of interest from both the industrial and the academic perspective. This book provides an up-date on the principle methods employed to obtain dynamic kinetic resolution (DKR) by either enzymatic or non-enzymatic methods. It also illustrates the diversity of useful chiral products that can be obtained through this powerful concept. Divided into three sections, the book deals successively with non-enzymatic methods, enzymatic methods, and the use of transition metals and enzymes in tandem","torrent":{"xt":"urn:btih:83bd3bc06dd6216c73cd58b3b0ac14ecf534fb29","amp;dn":"Chirality+from+Dynamic+Kinetic+Resolution","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83bd3bc06dd6216c73cd58b3b0ac14ecf534fb29","infoHashBuffer":{"type":"Buffer","data":[131,189,59,192,109,214,33,108,115,205,88,179,176,172,20,236,245,52,251,41]},"announce":[],"urlList":[]}}