{"title":"Juelz Ventura Cuckold","uid":15275239,"size":466741248,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:89884679ff6115ac13678c19ea8178ab3bbb347a&amp;dn=Juelz+Ventura+Cuckold&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"lordnipp","files":1,"time":1468294059,"description":"The measure of white folks fucked in the head that visit me for help is astonishing. My most recent patient came to me since his significant other is dependent on enormous dark dick which leaves his modest white dick without consideration. I didn't think dicks understood that little yet when he demonstrated to me his smaller person part I couldn't keep down my snickering. Really, I about lost it once I had him put on the male virtuousness belt and the moron obliged it. It was the ideal opportunity for me to take my aptitudes to the following level even as unconventional as it appeared. My patient got a front column seat to see precisely what his better half was doing with the expectation that his comprehension could rescue the marriage. I got Jason Brown (alongside his 12 inches). To begin with, I got on my knees, loose my throat, and took him as far and profound as my stifler reflexes would permit. So far , so great to the extent my patient was concerned. The genuine test would be to perceive how he'd respond once he saw my white fuckbox getting furrowed much like his significant other's is yet away from public scrutiny. Jason then bowed me over and pummeled his enormous dark dick profound into my uterus as my shouts muffled his groans. Our session wouldn't be finished until the patient could settle that exclusive dark dick could fulfill white ladies. How might he demonstrate that? I made him tidy up all the dark goo from my butt that Jason utilized as an objective . Did I assist my patient? What difference does it make? For whatever length of time that I got my fill of dark dick then all was well. The what tops off an already good thing was that I made my patient pay for the whole hour as I got annihilated","torrent":{"xt":"urn:btih:89884679ff6115ac13678c19ea8178ab3bbb347a","amp;dn":"Juelz+Ventura+Cuckold","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89884679ff6115ac13678c19ea8178ab3bbb347a","infoHashBuffer":{"type":"Buffer","data":[137,136,70,121,255,97,21,172,19,103,140,25,234,129,120,171,59,187,52,122]},"announce":[],"urlList":[]}}