{"title":"The Sean Hannity Show Jul 11, 2016 Radio Show Full Podcast.mp3","uid":15282265,"size":69486044,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:8bf7e20a7c841ab311c933a4d7ec82b685445326&amp;dn=The+Sean+Hannity+Show+Jul+11%2C+2016+Radio+Show+Full+Podcast.mp3&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1468356387,"description":"Sean Hannity: Black Lives Matter's &quot;Advancing Narrative Is Killing Cops&quot;\r\n\r\n    SEAN HANNITY (HOST): It's a game this president plays. He's upset at all the high profile cases. Cambridge police. Trayvon Martin. &quot;That could've been me 35 years ago, that could've been my son.&quot; Ferguson. You know, he jumps in, weighs in, before black eyewitnesses pointed out that yeah, Michael Brown fought for a police officer's gun, charged at a police officer, and after he had robbed a convenience store and bullied a clerk. Wall Street Journal put things in perspective; it said &quot;and [Dallas Police] Chief [David] Brown and many like him in law enforcement don't feel like they get much support.&quot; It's because they don't until after the cops are dead. Then as always come the official condolences. Wow.\r\n\r\n    Anyway, the editorial goes on to say, &quot;Instead, what most people hear most of the time from groups like Black Lives Matter or Al Sharpton is inflammatory rhetoric that distorts reality and indiscriminately demonizes the police.&quot; Well I say Obama is guilty of this, when he rushed to judgement in Cambridge, and in Ferguson, and in the Freddie Gray case, and then the Trayvon Martin case. I think he's as guilty of this as anybody. And they even said &quot;Obama said it is possible to express support for the police 'while also saying there are problems across our criminal justice system.'&quot; And Obama brings Black Lives Matters [sic], the same group chanting &quot;pigs in a blanket, fry them like bacon&quot; to the White House.\r\n\r\n    You know, this belief promoted by Black Lives Matter which is America in 2016 is the same place as the Jim Crow South is a lie. That doesn't mean there aren't individual cops that are racist, or even that blacks, because they're black face challenges and obstacles and maybe suspicion that other people don't face, but that's all -- I'm not disputing that there are people like that. That would bother me. But Black Lives Matter is not the answer. They only make things worse because their advancing narrative is killing cops, and Hillary wants their endorsement","torrent":{"xt":"urn:btih:8bf7e20a7c841ab311c933a4d7ec82b685445326","amp;dn":"The+Sean+Hannity+Show+Jul+11%2C+2016+Radio+Show+Full+Podcast.mp3","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8bf7e20a7c841ab311c933a4d7ec82b685445326","infoHashBuffer":{"type":"Buffer","data":[139,247,226,10,124,132,26,179,17,201,51,164,215,236,130,182,133,68,83,38]},"announce":[],"urlList":[]}}