{"title":"En.Kvall.i.New.York.S01.720p.WEBRip.x264-DRN","uid":15853908,"size":4908897634,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:905f50f728e9b95f9d1707e4ae50fe756cdb374f&amp;dn=En.Kvall.i.New.York.S01.720p.WEBRip.x264-DRN&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":5,"time":1474204319,"description":"En kväll i New York\r\n===================\r\n\r\nPå legendariska Apollo Theater i New York har världsartister som Billie Holiday, Ella Fitzgerald, Stevie Wonder, Michael Jackson, James Brown och Aretha Franklin uppträtt. Nu får några av Sveriges största artister chansen att sjunga där.\r\n\r\n-------------------\r\n\r\nLör 27 aug 20.00, 2016\r\n\r\nDel 1 av 4. På legendariska Apollo Theater i New York har världsartister som Billie Holiday, Ella Fitzgerald, Stevie Wonder, Michael Jackson, James Brown och Aretha Franklin uppträtt. Nu får några av Sveriges största artister chansen att sjunga där. Varje artist väljer en låt, och tillsammans med en gospelkör får de en chans att få taket på Apollo att lyfta. Artisterna i första avsnittet är Zara Larsson, Titiyo, Darin och Roger Pontare.\r\n\r\nLör 3 sep 20.00, 2016\r\n\r\nDel 2 av 4. Artisterna denna gång är Sarah Dawn Finer, Linda Pira och Andreas Lundstedt. På legendariska Apollo Theater i New York har världsartister som Billie Holiday, Ella Fitzgerald, Stevie Wonder, Michael Jackson, James Brown och Aretha Franklin uppträtt. Nu får några av Sveriges största artister chansen att sjunga där. Varje artist väljer en låt, och tillsammans med en gospelkör får de en chans att få taket på Apollo att lyfta.\r\n\r\nLör 10 sep 20.00, 2016\r\n\r\nDel 3 av 4. Artister denna kväll är Charlotte Perrelli, Molly Sandén och Oscar Zia. På legendariska Apollo Theater i New York har världsartister som Billie Holiday, Ella Fitzgerald, Stevie Wonder, Michael Jackson, James Brown och Aretha Franklin uppträtt. Nu får några av Sveriges största artister chansen att sjunga där. Varje artist väljer en låt, och tillsammans med en gospelkör får de en chans att få taket på Apollo att lyfta.\r\n\r\nLör 17 sep 20.00, 2016\r\n\r\nDel 4 av 4. Denna gång ser vi Niklas Strömstedt, Sabina Ddumba och Andreas Johnson. På legendariska Apollo Theater i New York har världsartister som Billie Holiday, Ella Fitzgerald, Stevie Wonder, Michael Jackson, James Brown och Aretha Franklin uppträtt. Nu får några av Sveriges största artister chansen att sjunga där. Varje artist väljer en låt, och tillsammans med en gospelkör får de en chans att få taket på Apollo att lyfta.\r\n\r\n- DARWiN","torrent":{"xt":"urn:btih:905f50f728e9b95f9d1707e4ae50fe756cdb374f","amp;dn":"En.Kvall.i.New.York.S01.720p.WEBRip.x264-DRN","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"905f50f728e9b95f9d1707e4ae50fe756cdb374f","infoHashBuffer":{"type":"Buffer","data":[144,95,80,247,40,233,185,95,157,23,7,228,174,80,254,117,108,219,55,79]},"announce":[],"urlList":[]}}