{"title":"Game of thrones S06E10 GR SUBS 720p - GrYazoo","uid":15324614,"size":418102295,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:91ec2fa24364927ea6fa485b3f29fb1ba1479d5c&amp;dn=Game+of+thrones+S06E10+GR+SUBS+720p+-+GrYazoo&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"YazooMix","files":4,"time":1468682805,"description":"Before her trial, Cersei destroys the Sept of Baelor with wildfire, killing the High Sparrow, Margaery, Mace and Loras Tyrell, and Lancel and Kevan Lannister, along with hundreds of King's Landing nobles and the Faith Militant. Horrified, Tommen throws himself off a balcony to his death. In Dorne, Varys meets with Olenna Tyrell and Ellaria Sand, seeking to form an alliance between Daenerys and their houses against the Lannisters. Davos confronts Melisandre over the death of Shireen Baratheon; Jon banishes her from Winterfell. Following their victory, the Wildlings, the Knights of the Vale and the surviving Houses of the North pledge loyalty to Jon Snow as the new King in the North. Sansa learns of Littlefinger's plans for her as the new Lady of Winterfell. Following a banquet with Jaime, Walder Frey is murdered by Arya. Sam and Gilly reach the Citadel in Oldtown. Bran sees a vision from inside the Tower of Joy: Ned finds his dying sister Lyanna, and takes her newborn son as his bastard. Jaime returns to King's Landing to find the Sept in ruins and Qyburn crowning Cersei the new Queen of Westeros. Daenerys sets sail to Westeros with her companions, armies and dragons","torrent":{"xt":"urn:btih:91ec2fa24364927ea6fa485b3f29fb1ba1479d5c","amp;dn":"Game+of+thrones+S06E10+GR+SUBS+720p+-+GrYazoo","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91ec2fa24364927ea6fa485b3f29fb1ba1479d5c","infoHashBuffer":{"type":"Buffer","data":[145,236,47,162,67,100,146,126,166,250,72,91,63,41,251,27,161,71,157,92]},"announce":[],"urlList":[]}}