{"title":"Natuk full game [best roleplay game ever].rar","uid":15439616,"size":13742207,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:92a4fc543899f2dbe4571fbdc7ffb16f955ad080&amp;dn=Natuk+full+game+%5Bbest+roleplay+game+ever%5D.rar&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Vigilante8","files":1,"time":1469807865,"description":"Maybe The best roleplay game ever!\r\n\r\n\r\nThe Game\r\nNatuk is a traditional CRPG. It features turn-based combat, an overhead view, and a straightforward plot. It is in combat where Natuk truly shines... there has never been a CRPG with such detailed and satisfying turn-based combat.\r\n\r\nYou have as much time as you want to consider each move. Blows can be aimed at locations such as necks and arms to find weaknesses in your opponents' armor. Superior swordplay can disarm an opponent, or you can simply pound on his armor to beat him into exhausted unconsciousness.\r\n\r\nAssassins can sneak behind enemy formations to strike from behind... shamans and witchdoctors can cast spells ranging from the easy and weak to such powerful spells as comet strike, banish, chain lightning, and death ball. Meanwhile, the enemy comes closer, with one goal... your death.\r\n\r\nAs you defeat your opponents, experience points are gained which can be spent on any of the thirty-eight skills. Each of the five character classes can improve any of the skills, but some are better at some skills than others. With time, however, even a stupid half-troll warrior may be able to stutter out a few spells.\r\n\r\nFrom the beginning of the game, your goal is clear. Molvosh must die. But how to succeed, which dungeons to plunder, and when to strike are decisions you must make. And if you should succeed, you can try again on a higher difficulty level or with a different party composition. And many of the items you find in Natuk are randomly generated, unique from game to game.\r\n\r\nNatuk features thirty-three dungeon areas and over 150 different monsters. There are over 160 different spells and hundreds of thousands of different types of items, both magical and mundane.\r\n  \nhttp://www.proudft.com/natuk.html\r\n\r\ni buy 100% full version,and now i share it for you.\r\n\r\nenjoy!","torrent":{"xt":"urn:btih:92a4fc543899f2dbe4571fbdc7ffb16f955ad080","amp;dn":"Natuk+full+game+%5Bbest+roleplay+game+ever%5D.rar","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92a4fc543899f2dbe4571fbdc7ffb16f955ad080","infoHashBuffer":{"type":"Buffer","data":[146,164,252,84,56,153,242,219,228,87,31,189,199,255,177,111,149,90,208,128]},"announce":[],"urlList":[]}}