{"title":"Laura-Ingraham Podcast Santorum Hypocrocy DNC","uid":15441389,"size":34297436,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:96605ad41448cc82037932957e31be9f47e104c3&amp;dn=Laura-Ingraham+Podcast+Santorum+Hypocrocy+DNC&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1469824553,"description":"Laura Ingraham July 29,2016\r\nRick Santorum contrasts the RNC and the DNC Pat Caddell reacts to the hypocrisy of the DNC \r\n\r\nGuest Lineup\r\nRick Santorum - Former U.S. Senator and 2012 &amp; 2016 presidential candidate\r\nPat Caddell - Democratic pollster and Fox News Contributor\r\nMichael Steele - Former RNC chairman and MSNBC Contributor\r\n\r\nTrump Has the Upper Hand in This Contest\r\nConrad Black - New York Sun\r\nThe last of the endless refuges of the Never Trump brigades were vacated as the once unthinkable Trump campaign departed Cleveland victorious. All the claims that there would be an anti-Trump coup attempt by procedural experts at the convention, or a fractured party and a third candidate, or a political disaster that would cause the Republican congressional leadership to &quot;drop [Trump] like a hot rock&quot; (in Senator Mitch McConnell's words), all to be followed naturally by a Clinton landslide - none of it happened.\r\n\r\nGlobalists Must Unite Behind Hillary\r\nAs political theatre, America's party conventions have no parallel. Activists from right and left converge to choose their nominees and celebrate conservatism (Republicans) and progressivism (Democrats). But this year was different, and not just because Hillary Clinton became the first woman to be nominated for president by a major party. The conventions highlighted a new political faultline: not between left and right, but between open and closed (see article). Donald Trump, the Republican nominee, summed up one side of this divide with his usual pithiness. &quot;Americanism, not globalism, will be our credo,&quot; he declared. His anti-trade tirades were echoed by the Bernie Sanders wing of the Democratic Party.\r\n\r\nSince When Does the Left Believe America is Great?\r\nEugene Slaven - The American Thinker\r\nIn what was mercifully one of his last major primetime speeches as president, Barack Obama declared to the fawning hordes at the Democratic National Convention that &quot;America is already great.&quot;\r\n\r\nClinton Caps Career With Historic Nomination\r\nEmily Goodin, Caitlin Huey-Burns &amp; Alexis Simendinger - Real Clear Politics\r\nHillary Clinton came full circle here Thursday night, completing her long arc from controversial first lady who defended her philandering husband to New York senator who saw the 2008 presidential nomination taken from her by a rising star from Illinois to secretary of state who became embroiled in the Benghazi and email scandals to her party's nominee.\r\n\r\nWhere the Election Goes From Here\r\nNate Silver - FiveThirtyEight\r\nIn contrast to Republicans, whose convention had a random-seeming parade of speakers each night, Democrats mostly hit their marks and stuck to the traditional convention script. Each day of the Democratic National Convention had an overarching strategic goal. Monday was about uniting the party.\r\n\r\nHillary Clinton's Historic Night Marred By Contradiction And Dissent\r\nIf you watched the final night of the Democratic Convention on television at home or at a watch party, it might have seemed like everything went pretty well for Hillary Clinton and the Democrats. She gave a decent speech, hit all the points she need to hit, there were some strong speeches earlier in the night, and despite some disruptions from protesters earlier in the week the convention ended up being more or less the media spectacle party officials hoped it would be.\r\n \nhttp://www.lauraingraham.com/","torrent":{"xt":"urn:btih:96605ad41448cc82037932957e31be9f47e104c3","amp;dn":"Laura-Ingraham+Podcast+Santorum+Hypocrocy+DNC","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96605ad41448cc82037932957e31be9f47e104c3","infoHashBuffer":{"type":"Buffer","data":[150,96,90,212,20,72,204,130,3,121,50,149,126,49,190,159,71,225,4,195]},"announce":[],"urlList":[]}}