{"title":"NubileFilms - Janice Griffith (Persuasive Beauty) NEW 15 July 20","uid":15310946,"size":399645461,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:9b75dca124e000a111006dd79df8105823da6618&amp;dn=NubileFilms+-+Janice+Griffith+%28Persuasive+Beauty%29+NEW+15+July+20&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxlavalxxx","files":2,"time":1468579975,"description":"Blonde bombshell Janice Griffith is bent on seduction with her super skinny body clad in a sheer pink bra and barely-there thong. When she struts up to Johnny Castle in her high heels, he knows that it's time to stop getting ready for work and to start pleasuring the willing woman in his bed.Starting with a series of lusty kisses, Johnny gradually works his way down Janice's body. Her bra is soon pulled down as Johnny unveils her full boobs. When he pulls Janice's thong aside to sample her delectable wetness, Johnny finds her delicious and ready for fun. Peeling her thong off, he dives in for an extended pussy licking and fingering session.After licking Johnny's fingers clean of her pussy juices, Janice enjoys her victory over his plan to go to work by helping him undress. In a matter of moments his clothes have started hitting the floor, unveiling his long thick dick for Janice's pleasure. She wastes no time dropping to her knees and wrapping her puffy lips around the head of his cock. Soon she is sucking away and even deep throating his long stiffie for both of their pleasure...\r\nCategories: Medium Boobs Shaved Pussy Short Girls Blonde Long hair Bras Hardcore Tan Thongs High Heels Petite Tan Lines Girl-Boy Blowjob Super Skinny Deep Throat Pussy Licking\r\n \nhttp://imgdone.com/viewer.php?file=07767153004531950860.jpg\r\n \nhttp://imgdone.com/viewer.php?file=41917020023335404096.jpg","torrent":{"xt":"urn:btih:9b75dca124e000a111006dd79df8105823da6618","amp;dn":"NubileFilms+-+Janice+Griffith+%28Persuasive+Beauty%29+NEW+15+July+20","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b75dca124e000a111006dd79df8105823da6618","infoHashBuffer":{"type":"Buffer","data":[155,117,220,161,36,224,0,161,17,0,109,215,157,248,16,88,35,218,102,24]},"announce":[],"urlList":[]}}