{"title":"TheRealWorkout - Avalon Heart (Le Tour De Cock) NEW 12 July 2016","uid":15277068,"size":594102921,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:9c8422f9831576f2029a9e45999cd64300f91929&amp;dn=TheRealWorkout+-+Avalon+Heart+%28Le+Tour+De+Cock%29+NEW+12+July+2016&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxlavalxxx","files":2,"time":1468312642,"description":"Some people train a lifetime, for a moment like this! Avalon is super pumped to be competing in the Tour De France this year, and has been doing everything she can to be super prepared. Whether it be eating healthy, going the extra 10 miles, or investing in cycling equipment, there is no limit that will stop her from achieving her goal of placing in this competition. The only thing that has been a bother for her is how extremely sore she has been getting after a session, luckily she has a physical trainer on speed dial who can help her out with any and all her needs. When he gets over, he can sense how tense she is and gets right to work. After only a few strokes of rubbing, Avalon reveals her pussy and asks for a huge favor. Her training is going to start going into OVERDRIVE in the next few days, and she will barely have any time to be fucking, so she needs one last dicking to really keep her in shape. This physical trainer wastes no time and goes from rubbing her legs to sucking her pussy real quick. Avalon has no problem riding him slutty style on the couch, seems like she wasnt as sore as she thought after all! Her trainer hit it doggy then switched it up yet again. Proceeding the intense ramming, he crowned her mouth with a fresh batch of some baby goo, affirming to Avalon that she reached the goal. The Tour De Cock has been won, but we cant wait to see how she does in the real race. GO AVALON!\r\nTags: Blowjob, Brunette, Deepthroat, Doggystyle, Handjob, Home, Living Room, Long Hair, Massage, Oil, Shaved Pussy, Skinny, Straight\r\n \nhttp://imgdone.com/viewer.php?file=79821343880961566858.jpg\r\n \nhttp://imgdone.com/viewer.php?file=87293061180193064733.jpg","torrent":{"xt":"urn:btih:9c8422f9831576f2029a9e45999cd64300f91929","amp;dn":"TheRealWorkout+-+Avalon+Heart+%28Le+Tour+De+Cock%29+NEW+12+July+2016","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c8422f9831576f2029a9e45999cd64300f91929","infoHashBuffer":{"type":"Buffer","data":[156,132,34,249,131,21,118,242,2,154,158,69,153,156,214,67,0,249,25,41]},"announce":[],"urlList":[]}}