{"title":"{PrettyDirty} Lea Lexis, Xander Corvus, Small Hands, James Bart","uid":15792854,"size":636942667,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:9f04467e306357121acb61e9f3a6b878b3394d24&amp;dn=+%7BPrettyDirty%7D+Lea+Lexis%2C+Xander+Corvus%2C+Small+Hands%2C+James+Bart&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"porn4u","files":1,"time":1473405765,"description":"{PrettyDirty} Lea Lexis, Xander Corvus, Small Hands, James Bartholet - The DP Brothers .....(09 September 2016).........P4U.......\r\n\r\n\r\n\r\n\r\nComing off a crazy night of drugs and debauchery, the DP Brothers Small Hands and Xander Corvus are not happy their rich dad James Bartholet is ragging on them for maxing out their credit cards. He wants them to get a job, but all they do is party, and grieve the loss of their mother. Dad is kicking them out of house, unless they can pay rent, but it's okay for his replacement wife Lea Lexis to spend all his money, dishonoring their beloved late mother. Feeling pretty entitled to expend some revenge, the DP Brothers feed the mail order bride a story. Here in America, it is customary to mark an occasion of marriage, by sleeping with the sons of her husband. 'In America,' they caution their stepmother, 'family traditions aren't taken lightly.' In that case, she completely understands, even if this particular custom does sound a little strange. If there's one thing Lea believes in, it's the importance of family. She concedes, it would be wrong if she doesn't do her part to bring the family closer together. Inside the shrine of their dead mother, beside the urn that is her final resting place, the DP Brother's whip out their stiff dicks, and Lea begins to stroke them both at the same time. She takes them in her mouth, one cock at a time. Then the boys fuck her in the pussy, one cock at a time. She's excited to try anal sex, because her boys say, it's as American as it gets! Babbling between orgasms in her native Romanian, it's clear this stepmom loves taking two cocks at the same time. It makes her cum hard when her boys are happy. As Small and Xander switch up their dicks, double penetrating her wet pussy and tight asshole, they fuck her hard till they cum on her face. Then they say 'CHEESE!' and smile for the camera. A 'fuck you' photo memento is left someplace conspicuous for Dad. Now, if only those boys could apply themselves like that to getting a job!\r\n\r\nScreenshoot:\r\n\r\n \nhttp://imagecopa.com/viewer.php?file=71748654049429543523.jpg\r\n \nhttp://imagecopa.com/viewer.php?file=15201451897545622933.jpg","torrent":{"xt":"urn:btih:9f04467e306357121acb61e9f3a6b878b3394d24","amp;dn":"+%7BPrettyDirty%7D+Lea+Lexis%2C+Xander+Corvus%2C+Small+Hands%2C+James+Bart","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f04467e306357121acb61e9f3a6b878b3394d24","infoHashBuffer":{"type":"Buffer","data":[159,4,70,126,48,99,87,18,26,203,97,233,243,166,184,120,179,57,77,36]},"announce":[],"urlList":[]}}