{"title":"All That Remains Discography (2016) @320kbps","uid":15610009,"size":729985096,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9f61c480d5a0fbf440b60ff1a64603c5a597a6e7&amp;dn=All+That+Remains+Discography+%282016%29+%40320kbps&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Vogard7A","files":88,"time":1471762521,"description":"All That Remains Discography\r\n\r\n\r\nStudio songs are always at 320kbps for all Vogard7A torrents.\r\n\r\n\r\nAll That Remains is an American heavy metal band from Springfield, Massachusetts, formed in 1998.[1] They have released seven studio albums, a live CD/DVD, and have sold over a million records worldwide. The group consists of vocalist Philip Labonte, guitarists Oli Herbert and Mike Martin, bassist Aaron Patrick and former Diecast drummer Jason Costa, with Labonte and Herbert being the only two original members. In spite of this, the band's line-up had remained consistent from the release of 2008's Overcome until 2015's The Order of Things, spanning four albums. This line-up changed, however, in September 2015, when long-time bassist Jeanne Sagan left the band, with Patrick taking her place.\r\n\r\n\r\nAlbums Included:\r\n2002 - Behind the Silence and Solitude\r\n2004 - This Darkened Heart\r\n2006 - The Fall of Ideals\r\n2008 - Overcome\r\n2010 - For We Are Many\r\n2012 - A War You Cannot Win\r\n2015 - The Order of Things\r\n\r\n\r\n\r\n\r\nVogard7A forms discographies under the following standards:\r\n1. All studio songs must be present at 320kbps.\r\n2. Demos are not required, but if included they will be included as duplicates.\r\n3. Live albums are not required, but will be included if not difficult to find.\r\n4. If acoustic or instrumental versions are rare, then it is not necessary to include them.\r\n5. If some songs were never released in an LP or EP, i.e. from a soundtrack, then a &quot;Rare and Misc&quot; folder will include the overflow. Number is based on date they were created. If some songs were only ever included in Singles, they may or may not get a Single album, based on judgement.\r\n6. The goal is to be able to open a folder from your music player and have all of the songs available without duplicates. Because of this I will not include an identical song twice, with priority given to older album &gt; newer album &gt; EP &gt; Single.\r\n7. Metadata for all songs are edited by hand gathering information from sources like Wikipedia or Discogs.\r\n8. All Discographies are to be updated once a year in case of new albums, with the latest year in the title of the torrent.\r\n9. NEVER mention the name Vogard7A in any metadata or comments. I share music, I don't need to stamp my name on other peoples' great work.\r\n10. Include a playlist with my favorite songs from each band! You can delete this if it gets in the way.\r\n\r\nIf there are any errors (not subjective opinions about organization) drop a comment and I'll look at it before updating the Discography next year!","torrent":{"xt":"urn:btih:9f61c480d5a0fbf440b60ff1a64603c5a597a6e7","amp;dn":"All+That+Remains+Discography+%282016%29+%40320kbps","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f61c480d5a0fbf440b60ff1a64603c5a597a6e7","infoHashBuffer":{"type":"Buffer","data":[159,97,196,128,213,160,251,244,64,182,15,241,166,70,3,197,165,151,166,231]},"announce":[],"urlList":[]}}