{"title":"UFC 200: Tate nes [Card Completo][720p][BR]","uid":15262994,"size":7042855184,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:a5423c40c15eb03e7de76e602c7ae6f0fedf7d0a&amp;dn=UFC+200%3A+Tate+nes+%5BCard+Completo%5D%5B720p%5D%5BBR%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kronaky","files":2,"time":1468191276,"description":"Descrição: Será o primeiro evento na moderna T-Mobile Arena\r\n\r\nA luta principal, era prevista para ser a revanche entre Nate Diaz e o atual campeão dos Penas Conor McGregor, no entanto o irlandês descumpriu várias condições do UFC e por insubordinação foi sacado do card.\r\n\r\nJosé Aldo é esperado para fazer a revanche contra Frankie Edgar, Pelo Cinturão Peso Pena Interino do UFC na primeira luta entre eles no UFC 156 o brasileiro saiu vencedor por pontos.\r\n\r\nMiesha Tate é esperada para defender o Cinturão Peso Galo Feminino do UFC, Contra a Brasileira Amanda Nunes.[1]\r\n\r\nGegard Mousasi era esperado para enfrentar Derek Brunson, mas por conta de uma lesão, Brunson teve que ser retirado do card, sendo substituído por Thiago Marreta.\r\n\r\nJon Jones era esperado para a revanche contra Daniel Cormier, na disputa pelo cinturão dos Meio-Pesados, mas Jones caiu no exame antidoping.\r\n\r\nUm dia após a saída de Jon Jones do card, o UFC anuncia Anderson Silva para luta contra Daniel Cormier. O combate será feito no peso meio pesado, até 93Kg, entretanto não valerá o titulo da categoria.\r\n\r\nFormato: MKV\r\nQualidade: WEB-DL\r\nÁudio: Nacional\r\nCodec de Áudio: AC3\r\nCodec de Vídeo: H.264\r\nIdioma: Português\r\nDuração: 5h e 0min.\r\nResolução: 1280x720\r\nTransmição: Canal Combate \r\nExibido: 09/07/2016\r\nTamanho: 6.56 GB\r\n\r\nUFC 200\r\n9 de julho de 2016, em Las Vegas (EUA)\r\nCARD PRINCIPAL\r\nAmanda Nunes venceu Miesha Tate por finalização aos 3m16s do R1\r\nBrock Lesnar venceu Mark Hunt por decisão unânime (triplo 29-27)\r\nDaniel Cormier venceu Anderson Silva por decisão unânime (triplo 30-26)\r\nJosé Aldo venceu Frankie Edgar por decisão unânime (49-46, 49-46, 48-47)\r\nCain Velásquez venceu Travis Browne por nocaute técnico aos 4m57s do R1\r\nCARD PRELIMINAR\r\nJulianna Peña venceu Cat Zingano por decisão unânime (triplo 29-28)\r\nKelvin Gastelum venceu Johny Hendricks por decisão unânime (29-28, 30-27, 30-27)\r\nTJ Dillashaw venceu Raphael Assunção por decisão unânime (triplo 30-27)\r\nSage Northcutt venceu Enrique Marin por decisão unânime (triplo 29-28)\r\nJoe Lauzon venceu Diego Sanchez por nocaute técnico a 1m26s do R1\r\nGegard Mousasi venceu Thiago Marreta por nocaute aos 4m32s do R1\r\nJim Miller venceu Takanori Gomi por nocaute técnico aos 2m18s do R1","torrent":{"xt":"urn:btih:a5423c40c15eb03e7de76e602c7ae6f0fedf7d0a","amp;dn":"UFC+200%3A+Tate+nes+%5BCard+Completo%5D%5B720p%5D%5BBR%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5423c40c15eb03e7de76e602c7ae6f0fedf7d0a","infoHashBuffer":{"type":"Buffer","data":[165,66,60,64,193,94,176,62,125,231,110,96,44,122,230,240,254,223,125,10]},"announce":[],"urlList":[]}}