{"title":"[NubileFilms] - Cayla (Sensual Tease) [NEW August 12, 2016]","uid":15549879,"size":190790563,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:a7d87cda23bf2acf0e9983441bb4ee8dc9385ec9&amp;dn=%5BNubileFilms%5D+-+Cayla+%28Sensual+Tease%29+%5BNEW+August+12%2C+2016%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ImgSnaps","files":1,"time":1471011247,"description":"[NubileFilms] - Cayla (Sensual Tease) [NEW August 12, 2016]\r\n\r\nScreenshots:\r\n \nhttp://imgsnaps.com/img2-57adbd938e3f8.html\r\n \nhttp://imgsnaps.com/img2-57adbd939432d.html\r\n \nhttp://imgsnaps.com/img2-57adbd939b0a5.html\r\n\r\n\r\nCayla – Sensual Tease\r\nReleased: August 11, 2016\r\n\r\nCayla has decked herself out in a seductive teddy and sheer thong, the perfect getup to seduce Nick Larsen. Her writhing movements accentuate a lusty striptease as this blonde haired blue eyed goddess slowly works the lingerie down to reveal her small boobs and then rubs her rock hard nipples to let Nick know just how very turned on she is. When Nick finally canâ™t take watching a moment longer, Cayla invites him onto the bed for a good time. Nick is fast to home in on the lusty delight of Caylaâ™s landing strip pussy. Burying his face between her legs, he uses his tongue and fingers to create the perfect amount of pressure. He alternates between her clit and twat until Cayla is writhing and moaning on the bed. When she flips onto her belly and takes Nickâ™s cock in her greedy mouth and then between her stockinged feet, it makes her loverâ™s day. Now that Nick is finally rock hard and ready to play, Cayla climbs onto his dick for a stiffie ride. Her hips gyrate as she takes what she wants from her lover, accentuating her pleasure by pinching her own nipples. Turning around, she locks eyes with Nick and leans forward to steal a kiss as they prepare to change positions. Next up Cayla gets on her hands and knees to let Nick take her from behind. He is glad to accept her invitation. He slides home in her wet channel, pumping his hips while Cayla pushes back to meet his every stroke. Thereâ™s no stopping them until Cayla has come apart in his arms, at which point they only break to change positions so that Nick can spoon Cayla from behind. This new position hits all the right spots, and within moments Cayla is ready for round two. Her moans fill the room, especially once she starts working her own clit. Sheâ™s on a hare trigger, which is just what Nick wants since the moment her next climax starts he pulls out for a cum explosion of his own. Cayla is all smiles as she is covered in her loverâ™s jizz, the perfect ending to their lovemaking.\r\n\r\nFile size : 182 MiB\r\nDuration : 17mn 38s\r\nBit rate : 1 308 Kbps\r\nWidth : 960 pixels\r\nHeight : 540 pixels\r\nDisplay aspect ratio : 16:9","torrent":{"xt":"urn:btih:a7d87cda23bf2acf0e9983441bb4ee8dc9385ec9","amp;dn":"%5BNubileFilms%5D+-+Cayla+%28Sensual+Tease%29+%5BNEW+August+12%2C+2016%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7d87cda23bf2acf0e9983441bb4ee8dc9385ec9","infoHashBuffer":{"type":"Buffer","data":[167,216,124,218,35,191,42,207,14,153,131,68,27,180,238,141,201,56,94,201]},"announce":[],"urlList":[]}}