{"title":"NubileFilms - Jenna Sativa, Lucy Doll (Feels So Good) NEW 06 Jul","uid":15229350,"size":343227790,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:a83fcfd22a9abc9404812fc83c73fb54f8e134d2&amp;dn=NubileFilms+-+Jenna+Sativa%2C+Lucy+Doll+%28Feels+So+Good%29+NEW+06+Jul&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxlavalxxx","files":2,"time":1467805060,"description":"Lucy Doll is enjoying a bath when her girlfriend Jenna Satvia decides to have some fun. Lucy is already rubbing her bare pussy and playing with her small boobs as Jenna dances nude and unnoticed behind the glass window. When Jenna finally comes in to get Lucy's attention, she is determined to give them both a good time!Slipping into a kimono, Jenna pulls Lucy forward for a kiss. She's quick to immediately peel off her scant clothes when Lucy proves that she's interested in pleasure, and soon Jenna is perched nude on the edge of the tub. She licks the moisture from Lucy's shoulders, and then climbs into the warm water so that they can exchange a long lingering kiss that speaks volumes to how badly both girls need to cum.Pushing Lucy to the edge of the tub, Jenna makes it clear that she's in charge. Lucy is happy to let Jenna have her way with her, hoping up onto the edge of the tub so that every inch of her body is easy for her lover to access. Jenna wastes no time, pressing her mouth to Lucy's love button while reaching up to grope her lover's tits...\r\nCategories: Small Boobs Medium Boobs Shaved Pussy Landing Strip Pussy Short Girls Brunette Long hair Wet Hardcore Lesbian Petite Girl-Girl Girl Orgasm Pussy Licking\r\n \nhttp://imgdone.com/viewer.php?file=55508325251499836272.jpg\r\n \nhttp://imgdone.com/viewer.php?file=67287795457515677852.jpg","torrent":{"xt":"urn:btih:a83fcfd22a9abc9404812fc83c73fb54f8e134d2","amp;dn":"NubileFilms+-+Jenna+Sativa%2C+Lucy+Doll+%28Feels+So+Good%29+NEW+06+Jul","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a83fcfd22a9abc9404812fc83c73fb54f8e134d2","infoHashBuffer":{"type":"Buffer","data":[168,63,207,210,42,154,188,148,4,129,47,200,60,115,251,84,248,225,52,210]},"announce":[],"urlList":[]}}