{"title":"Zippyshare Simple Search VER. - 2.7.1","uid":15768171,"size":4288378,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:a9e80ea7aa4113272cb4f9ad7753ddf374e6c39d&amp;dn=Zippyshare+Simple+Search+VER.+-+2.7.1&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ArnoldM3654","files":1,"time":1473180894,"description":"Introducing Zippyshare Simple Search and Download - the modern your file search engine and downloader for your content, at your fingertips .\r\nSearch. It’s where the web starts - and where it ends. With Zippyshare Simple Search and Download, we are connecting you to everything that the internet has to offer - from your own music files to APK files, and everything else in-between.\r\n\r\n       Zippyshare Simple Search and Download connects you to a world of content - from great games, to great music... it’s all just a tap away. It’s like a search engine, but for files. Search for anything and find what you want within seconds - it’s fast, fluid and free.\r\n\r\n       Our new Android application puts a world of content in the palm of hand. Download your content from anywhere - Zippyshare simple search and download brings you closer to everything that you love.\r\n\r\n       Search and download your files with a tap and bring Zippyshare to your fingertips. You can find what you want within seconds. It’s simple to search and find what you want - and then just tap to download the file - it’s as easy as that.\r\nGet started today and start downloading what you want, when you want - with Zippyshare Simple Search and Download for Android!\r\n\r\n\r\nFeatures:\r\n- Fast, minimalistic and responsive design for fast-access to what you want.\r\n- The best way to download files to your device directly.\r\n- The ultimate Zippyshare search and download application for Android!\r\n- Sort and filter your search to get what you want!\r\n- Simplified to minimum. Just type, hit search, choose and download!","torrent":{"xt":"urn:btih:a9e80ea7aa4113272cb4f9ad7753ddf374e6c39d","amp;dn":"Zippyshare+Simple+Search+VER.+-+2.7.1","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9e80ea7aa4113272cb4f9ad7753ddf374e6c39d","infoHashBuffer":{"type":"Buffer","data":[169,232,14,167,170,65,19,39,44,180,249,173,119,83,221,243,116,230,195,157]},"announce":[],"urlList":[]}}