{"title":"Metal-Polymer Nanocomposites","uid":15445416,"size":6916130,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:abc6a1bdec91789fdd984505f82732ee2c10f437&amp;dn=Metal-Polymer+Nanocomposites&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clouderone","files":1,"time":1469874906,"description":"Metal-Polymer Nanocomposites - Luigi Nicolais, Gianfranco Carotenuto (Wiley-Interscience, 2005).pdf\r\n\r\nA unique guide to an essential area of nanoscience\r\nInterest in nano-sized metals has increased greatly due to their special characteristics and suitability for a number of advanced applications. As technology becomes more refined-including the ability to effectively manipulate and stabilize metals at the nanoscale-these materials present ever-more workable solutions to a growing range of problems.\r\n\r\nMetal-Polymer Nanocomposites provides the first guide solely devoted to the unique properties and applications of this essential area of nanoscience. It offers a truly multidisciplinary approach, making the text accessible to readers in physical, chemical, and materials science as well as areas such as engineering and topology.\r\n\r\nThe thorough coverage includes:\r\n\r\nThe chemical and physical properties of nano-sized metals\r\nDifferent approaches to the synthesis of metal-polymer nanocomposites (MPN)\r\nAdvanced characterization techniques and methods for study of MPN\r\nReal-world applications, including color filters, polarizers, optical sensors, nonlinear optical devices, and more\r\nAn extensive list of references on the topics covered\r\nA unique, cutting-edge resource for a vital area of nanoscience development, Metal-Polymer Nanocomposites is an invaluable text for students and practitioners of materials science, engineering, polymer science, chemical engineering, electrical engineering, and optics","torrent":{"xt":"urn:btih:abc6a1bdec91789fdd984505f82732ee2c10f437","amp;dn":"Metal-Polymer+Nanocomposites","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"abc6a1bdec91789fdd984505f82732ee2c10f437","infoHashBuffer":{"type":"Buffer","data":[171,198,161,189,236,145,120,159,221,152,69,5,248,39,50,238,44,16,244,55]},"announce":[],"urlList":[]}}