{"title":"Borderlands 2 v1.0.0.0.33 Android","uid":15470739,"size":4161277126,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:ae155214cbd339378027a4167f21f2a1035f6194&amp;dn=Borderlands+2+v1.0.0.0.33+Android&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":6,"uploader":null,"files":3,"time":1470135702,"description":"Borderlands 2\r\n\r\nPlay as one of four new vault hunters facing off against a massive new world of creatures, psychos and the evil mastermind, Handsome Jack exclusively for NVIDIA Shield Android TV and Tablet! Make new friends, arm them with a bazillion weapons and fight alongside them in 4 player co-op on a relentless quest for revenge and redemption across the undiscovered and unpredictable living planet.\r\nKey Features:\r\nAll-New Characters and All-New Classes: Four all new playable classes including the Siren, the Commando, the Gunzerker and the Assassin. Dual machine guns? Cool. Dual rocket launchers? Of course! Dual Sniper Rifles? Sure, if that’s your thing! Want to try other styles? More tactical perhaps? There are multiple classes to choose from!\r\n\r\nDynamic Co-op online: Share your adventures with friends online. Borderlands 2 features a seamless system enabling you to drop in and drop out of a campaign without ever having to restart the game. On top of that you can even take your new gear from any game to any other!\r\n\r\nWorld Connected Story: Find yourself left for dead in the frozen tundra of Pandora as you begin your quest of revenge and redemption. Expose the evil surrounding the Hyperion Corporation and take on the perpetrator of a universe-wide grand deception — the nefarious Hyperion CEO, Handsome Jack.\r\n87 Bazillion…Everything: In addition to the new gun system, you will lust after procedurally generated shields, grenades, Relics, class mods and much, much more. And you thought the original Borderlands had a ton of loot!\r\n\r\nBrand new environments on Pandora: Hunt through entirely brand new areas of Pandora that are more alive than ever! From the arctic tundra, through the dangerous grasslands, past the mysterious corrosive caverns to beyond, you’ll be surprised by the unpredictable world of Pandora at every turn!\r\nBrand new enemies: A whole slew of new enemies are out there to kill you in Borderlands 2. Hulking, gorilla-like Bullymongs, vicious predatory Stalkers and the Hyperion mechanical army, run by Handsome Jack, are just some of the new enemies in Borderlands 2.\r\n\r\nRequires :Android Varies With Device\r\n\r\nInstructions:\r\n\r\nInstall Apk\r\nCopy ‘com.tt2kgames.Borderlands2’ Folder to sdcard/Android/obb\r\nLaunch the Game\r\n\r\nTHE GAME REQUIRES CONTROLER FOR THE PHONE!!! :)","torrent":{"xt":"urn:btih:ae155214cbd339378027a4167f21f2a1035f6194","amp;dn":"Borderlands+2+v1.0.0.0.33+Android","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae155214cbd339378027a4167f21f2a1035f6194","infoHashBuffer":{"type":"Buffer","data":[174,21,82,20,203,211,57,55,128,39,164,22,127,33,242,161,3,95,97,148]},"announce":[],"urlList":[]}}