{"title":"The Sims 4 All Expansion Pack DLC","uid":15652939,"size":23508806734,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b2b9cb389912142431703767345edc510460fd74&amp;dn=The+Sims+4+All+Expansion+Pack+DLC&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":6,"uploader":"Sabrinarj","files":1,"time":1472116132,"description":"\nAlthough this expansion pack is cracked it still required to be played on the sims 4 based game in order for it to work!\r\nSo i have included a folder with the base game installation files inside the package as well :)\r\n\r\nBut DON'T WORRY these files are consider to be safe for your pc/macbook devices. \r\nThese files have already been scan and protected by an antivirus detecting software that has recommended to say that the files are 100% Virus Free!!\r\nLets Start The Tutorial==================&gt;&gt;&gt;&gt;&gt;\r\n\r\n  ******************** SYSTEM REQUIREMENTS **********************\r\n\r\nOS: Windows XP (SP3), Windows Vista (SP2), Windows 7 (SP1), Windows 8, or Windows 8.1 or Windows 10\r\nPROCESSOR: 1.8 GHz Intel Core 2 Duo, AMD Athlon 64 Dual-Core 4000+ or equivalent (For computers using built-in graphics chipsets, the game requires 2.0 GHz Intel Core 2 Duo, 2.0 GHz AMD Turion 64 X2 TL-62 or equivalent)\r\nMEMORY: At least 2 GB RAM\r\nHARD DRIVE: At least 9 GB of free space with at least 1 GB additional space for custom content and saved games\r\nDVD-ROM: DVD ROM drive required for installation only\r\nVIDEO CARD: 128 MB of Video RAM and support for Pixel Shader 3.0. Supported Video Cards: NVIDIA GeForce 6600 or better, ATI Radeon X1300 or better, Intel GMA X4500 or better\r\nSOUND CARD: DirectX 9.0c Compatible\r\nDIRECTX: DirectX 9.0c compatible\r\n\r\n  ******************** INSTRUCTIONS *****************************\r\n\r\nStep 1: Unzip the download rar file with a program called &quot;winrar&quot; if you do not have winrar install on your computer, then please go to this website: http://www.rarlab.com/download.htm to download the winrar setup.exe to install the program on your pc.\r\nStep 2: After installing winrar application on your pc and have extracted the files, Please move on to step 3.\r\nStep 3: In the folder you have extracted you see (2) folders. Click on The Sims 4 Step 1 Base Game Installation folder to open it.\r\nStep 4: Once its open look for the sims 4 setup.exe application. Click on it to start the installation process.\r\nStep 5: Once the installation is finish, exit out from the sims 4 step 1 setup folder. And move on to step 6.\r\nStep 6: Now open The Sims 4 Step 2 Copy All Files folder. As you can see there are some folders and (2) exe applications files. Select the items by using CTRL + A on keyboard.\r\nStep 7: After selecting all the files press and hold the CTRL button and DESELECT the following (3) files: &quot;Soundtrack&quot;, &quot;EA.Game.RegFix.exe&quot; and &quot;EASetup.exe&quot; \r\nStep 8: Once done that Copy the files that are SELECTED and paste them to where your sims 4 game is install on your computer. Example: If the sims 4 install to your C: drive then it will be C:Program FilesR.G. MechanicsThe Sims 4 for (Windows 32 &amp; 64)\r\nStep 9: Paste the files that you have copied in the sims 4 folder. If it asks you to Replace Files while copying Select Replace Files and hit the continue button.\r\nStep 10: Once you have finish copying all the files to the game folder you can now exit the folder and Run The Sims 4 application on your computer test it and it will WORK!!!\r\n\r\nThank you for downloading The Sims 4 All Expansion Pack. If you guys have any questions feel free to leave your inquires down in the comment section down below or you may contact me by my email:if you need any help!\r\nAnd if you do find my video tutorial helpful please consider yourself to subscribe for more video like these and also give the video a big thumbup and share it with your friends if this tutorial helps you.\r\n\r\nThanks for watching and do ENJOY!!!! :)","torrent":{"xt":"urn:btih:b2b9cb389912142431703767345edc510460fd74","amp;dn":"The+Sims+4+All+Expansion+Pack+DLC","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2b9cb389912142431703767345edc510460fd74","infoHashBuffer":{"type":"Buffer","data":[178,185,203,56,153,18,20,36,49,112,55,103,52,94,220,81,4,96,253,116]},"announce":[],"urlList":[]}}