{"title":"AIDA 1ª TEMPORADA DVD5 D1 SPANISH","uid":15658810,"size":4102070272,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b361614f85b5a3998ff16244c036cc350ff23ee6&amp;dn=AIDA+1%26ordf%3B+TEMPORADA+DVD5+D1+SPANISH&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":5,"uploader":"carbajalu","files":25,"time":1472170108,"description":"Aída es una serie de televisión, del género de la comedia de situación, producida por Globomedia para la cadena española Telecinco, que la estrenó el 16 de enero de 2005 Originalmente protagonizada por Carmen Machi en el papel de Aída García, surgió como un spin-off de la serie Siete Vidas, en la que Aída era una «chacha» que trabajaba para Sole (Amparo Baró) y que después empezó a trabajar también en el Kasi ké no, el bar de Gonzalo (Gonzalo de Castro). La serie comienza cuando el padre de Aída muere dejándole la casa familiar, a la que Aída decide regresar con sus dos hijos menores a cuestas; desatando así un sinfín de enredos cómicos que se desarrollan entre reencuentros casuales con antiguos vecinos y amigos, bromas sin sentido, etc. Sin embargo, durante la sexta temporada de la serie, Carmen Machi la abandona y entra en su lugar Miren Ibarguren, interpretando el papel de Soraya, la hija mayor de Aída, que se va a vivir con toda la familia, haciéndose cargo de ella.\r\n\r\nAlguno de los guionistas más habituales de la serie son Antonio Sánchez, Oriol Capel, Raúl Díaz, María Miranda, Nando Abad, Jordi Terradas, Sonia Pastor, Paula L. Cuervo, Julián Sastre, Roberto Jiménez, Juan R. Ruiz de Somavía, Almudena Ocaña, Francisco Arnal, Lele Morales, Alberto López, Daniel Monedero y Jorge Anes. Desde su estreno, Aída se ha situado entre los espacios con mayor audiencia de la cadena, siendo la serie televisiva más vista en España desde el año 2007.\r\n\r\nAdemás del respaldo de la audiencia, la serie ha recibido también múltiples premios, entre los que destacan el Ondas a la Mejor serie española; así como reconocimientos a sus actores como el TP de Oro, el Fotogramas de Plata y los Premios de la Unión de Actores","torrent":{"xt":"urn:btih:b361614f85b5a3998ff16244c036cc350ff23ee6","amp;dn":"AIDA+1%26ordf%3B+TEMPORADA+DVD5+D1+SPANISH","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b361614f85b5a3998ff16244c036cc350ff23ee6","infoHashBuffer":{"type":"Buffer","data":[179,97,97,79,133,181,163,153,143,241,98,68,192,54,204,53,15,242,62,230]},"announce":[],"urlList":[]}}