{"title":"Veggie Tales - Cartoons for Kids - Part 1.new","uid":15331237,"size":9371317583,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ba24ff26d86c3c9f734ea488c4bbe36bd75295e4&amp;dn=Veggie+Tales+-+Cartoons+for+Kids+-+Part+1.new&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":23,"time":1468720564,"description":"Description\r\nThe Bible Series - Veggie Tales - Cartoons for Kids - Part 1\r\n\r\nVeggieTales is an American series of children's computer animated films featuring anthropomorphic vegetables in stories conveying moral themes based on Christianity. The episodes frequently retell Bible stories anachronistically reframed and include humorous references to pop culture. The series was developed by Big Idea Entertainment and is owned by DreamWorks Animation through its subsidiary, DreamWorks Classics.[2]\r\n\r\nThe characters in VeggieTales were originally created by Phil Vischer. He and Mike Nawrocki began producing the films (Nawrocki later took over the entire project when the rights were bought by Classic Media), and they did many of the voices. Originally released in direct-to-video format, the series debuted on December 21, 1993. From September 9, 2006 to September 7, 2009, VeggieTales appeared on NBC as part of the Qubo Saturday morning children's programming block. On November 3, 2012 the show began running on the Trinity Broadcasting Network (TBN)[3] as well as its children's network Smile of a Child,[4] where it currently continues to air episodes (in a repackaged and edited format).\r\n\r\nIn 2009, Netflix made many VeggieTales videos (in their uncut, original formats) and feature films available via their video streaming service. On March 14, 2014, Netflix announced a new VeggieTales television show from DreamWorks Animation Television entitled VeggieTales in the House.[5] The first season of five shows was released on November 26, 2014. Big Idea has also published VeggieTales books and music CDs and branded items such as toys, clothing, and garden seeds for vegetables and flowers","torrent":{"xt":"urn:btih:ba24ff26d86c3c9f734ea488c4bbe36bd75295e4","amp;dn":"Veggie+Tales+-+Cartoons+for+Kids+-+Part+1.new","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba24ff26d86c3c9f734ea488c4bbe36bd75295e4","infoHashBuffer":{"type":"Buffer","data":[186,36,255,38,216,108,60,159,115,78,164,136,196,187,227,107,215,82,149,228]},"announce":[],"urlList":[]}}