{"title":"Polymer Structure Characterisation - From Nano to Macro Organiza","uid":15446487,"size":21454101,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:da2a2f6c1e7fe4ce8bdcaf47e81e2a656d024383&amp;dn=Polymer+Structure+Characterisation+-+From+Nano+to+Macro+Organiza&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clouderone","files":1,"time":1469891429,"description":"Polymer Structure Characterisation - From Nano to Macro Organization - Richard A Pethrick (RSC, 2007).pdf\r\n\r\nLow molar mass organic materials and polymers exhibit a range of physical properties that are dependent on their ability to undergo self organisation. The degree and extent of the molecular organisation depends on a complex interplay of inter and intra molecular interactions.\r\n\r\nPolymer Structure Characterization: From Nano to Macro Organization discusses in a systematic fashion the way in which molecular interactions influence observed morphologies. Topics include: organic crystals, liquid crystals, plastic crystals, polymer morphology, polymer crystallization, amorphous glassy materials, polymer surfaces, polymer phase separation and structure, and a brief introduction to organisation in naturally occurring materials.\r\n\r\nThis textbook is primarily aimed at polymer and material scientists but would also be of interest to chemists and physicists studying the properties of organic materials. It provides complimentary material for a range of courses in materials science, molecular chemistry and chemical physics","torrent":{"xt":"urn:btih:da2a2f6c1e7fe4ce8bdcaf47e81e2a656d024383","amp;dn":"Polymer+Structure+Characterisation+-+From+Nano+to+Macro+Organiza","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da2a2f6c1e7fe4ce8bdcaf47e81e2a656d024383","infoHashBuffer":{"type":"Buffer","data":[218,42,47,108,30,127,228,206,139,220,175,71,232,30,42,101,109,2,67,131]},"announce":[],"urlList":[]}}