{"title":"Punish Me Daddy (Desperate Pleasures) [2016 г., WEB-DL]","uid":15449205,"size":1623989328,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:dab52e9516b2ac06a279926763c345902773b879&amp;dn=Punish+Me+Daddy+%28Desperate+Pleasures%29+%5B2016+%D0%B3.%2C+WEB-DL%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Programsmith","files":3,"time":1469926939,"description":"Production year: 2016\r\n\r\n \nhttp://imageview.me/viewer.php?file=ace3b9hgvb.jpg\r\n \nhttp://imageview.me/viewer.php?file=c45vep9lo9.jpeg\r\n\r\nCountry: USA\r\nGenre: Teens, Domination, Family Roleplay, Fetish\r\nDuration: 1:43:08\r\nStudio: Desperate Pleasures\r\n\r\nStarring: Amelia Dire, Hope Harper, Annelise Snow, JW Ties\r\n\r\nDescription: Every Girl Needs A Little Discipline.\r\nAnnellese Snow. Dear Diary The other day I was home alone and started snooping in Daddy's dresser. I found one of mommies sex toys and I I could not help but feel a little naughty. My stepdad Russel walked in and caught me before it got to far but then he started punishing me. The more he spanked me the more turned on I got until I just lost controll seduced my stepdad right there in mommies bed. He was a bit resistant but soon we were making love all over the room. I can not wait for dad to punish me again. X0 Annellese\r\nAmelia Dire: After my folks divorced I lived with mom but she could not handle me. I flirted with her boyfriend and so soon she sent me to dad's. Over the first few weeks I stayed out later and later really pushing his but-tons. I had the perfect plan going as always cause I caught Daddy sneaking peeks at me. I knew he would be waiting up one night to punish me and I sure enough he was. Daddy started spanking me hard and I made my move and teased his cock Daddy had not been laid in so long it was easy to seduce him. He fucked me pretty good and even came inside me.\r\nHope Harper: Things have been great with Daddy for awhile but lately he has not been rough enough with me. I think I have the perfect plan to spice things up though. Tonight I'm going to stay out late and pretend to come home tipsy. Maybe that will get Daddy to punish me. Sure enough it worked like a charm. I came in looking pretty rough and he was waiting. Daddy spanked me and punished me on the couch then carried me to my room to have his way with me. What a great night especially when daddy spanked me as he came inside me.\r\n\r\nVideo Quality: WEB-DL\r\nVideo Format: MKV\r\nVideo: AVC, 2048 Kbps, 852 pixels, 480 pixels, 30.000 fps\r\nAudio: AAC, 61.7 Kbps, 2 channels, 44.1 KHz","torrent":{"xt":"urn:btih:dab52e9516b2ac06a279926763c345902773b879","amp;dn":"Punish+Me+Daddy+%28Desperate+Pleasures%29+%5B2016+%D0%B3.%2C+WEB-DL%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dab52e9516b2ac06a279926763c345902773b879","infoHashBuffer":{"type":"Buffer","data":[218,181,46,149,22,178,172,6,162,121,146,103,99,195,69,144,39,115,184,121]},"announce":[],"urlList":[]}}