{"title":"Butterflies (BBC comedy series 1978-1983), series 1-4","uid":15625344,"size":9132321396,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:db9f749a758b7ee79276d21a95c23cca4d7a9bec&amp;dn=Butterflies+%28BBC+comedy+series+1978-1983%29%2C+series+1-4&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":6,"uploader":"rontoolsie","files":30,"time":1471906922,"description":"Butterflies was a British sitcom series written by Carla Lane that was broadcast on BBC2 from 1978 to 1983.\r\n\r\nThe situation is the day-to-day life of the Parkinson family in a bittersweet style. There are both traditional comedy sources (Ria's cooking, family squabbles) and more unusual sources such as Ria's unconsummated[1] relationship with the outwardly-successful Leonard. Ria is still in love with her husband, Ben, and has raised two potentially fine sons, yet finds herself dissatisfied and in need of something more. Throughout the series Ria searches for that &quot;something more&quot; and finds some solace in her unconventional friendship with Leonard. In a 2002 interview, Carla Lane explained, &quot;I wanted to write a comedy about a woman contemplating adultery.&quot;[1]\r\nIn the first episode, an expository discussion between Ria and Leonard alludes to the significance of the series' title: &quot;We are all kids chasing butterflies. You see it, you want it, you grab it, and there it is, all squashed in your hand.&quot; She adds, &quot;I am one of the few lucky ones, I have a pleasant house, a pleasant man and two pleasant sons. My butterfly didn't get squashed.&quot; Ria's husband Ben collects and studies butterflies.\r\n\r\nThe show stars Wendy Craig as frustrated 'stay at home' housewife, Ria Parkinson and Geoffrey Palmer as her reserved dentist husband, Ben, who is also an amateur lepidopterist. Ria's early dialogue in the first series suggests her age as early 40s, whereas her husband, Ben, quotes himself to be &quot;the wrong side of 45&quot;. Ben is a typically traditional, conservative white-collar professional, ill at ease with his sons' lack of work-ethic and carefree post-punk attitudes (the series starts in 1978) whilst remaining unaware of his wife's impending mid-life crisis. They have been married for 19 years and are depicted as having a comfortable lifestyle, supported by one bread-winner in the household at a time in British history when 'stay at home' housewives were becoming less common. Ria's disastrous attempts at cooking are a recurring gag.\r\n\r\nThe Parkinsons have two sons, both of driving age (at least 17 years of age under UK law in 1978) and unemployed (in 1978 the UK was heading towards recession under Prime Minister, James Callaghan, with youth unemployment on the increase). Their youngest son, Adam, is played by Nicholas Lyndhurst and their older son, Russell, by Andrew Hall. Throughout all 4 series, there is a continuing sub-plot running in tandem with the main storyline, tracking the difficulties faced by young adolescent men coming of age in the UK during a period when there were few employment opportunities and the threat of nuclear war. Both of the Parkinson son's characters are seen making fun of their father's traditional post-war reserved British attitude, whilst also undergoing their own issues such as unemployment, girlfriend troubles, cannabis use against the wishes of their horrified father and teenage pregnancy, when Russell fathers a child with his on-off girlfriend. Bruce Montague plays Ria's friend Leonard, a successful businessman, aged 44 whose wife has recently left him and is, like Ria Parkinson, approaching his own mid-life crisis. The show also featured two recurring minor characters: Leonard's chauffeur and confidant Thomas (Michael Ripper) and the Parkinsons' cleaner, Ruby (Joyce Windsor), who often lent Ria an ear","torrent":{"xt":"urn:btih:db9f749a758b7ee79276d21a95c23cca4d7a9bec","amp;dn":"Butterflies+%28BBC+comedy+series+1978-1983%29%2C+series+1-4","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db9f749a758b7ee79276d21a95c23cca4d7a9bec","infoHashBuffer":{"type":"Buffer","data":[219,159,116,154,117,139,126,231,146,118,210,26,149,194,60,202,77,122,155,236]},"announce":[],"urlList":[]}}