{"title":"ANOS REBELDES","uid":15791093,"size":2201037692,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:df51c6b4e2f38d186d583b43620427e36fc871bf&amp;dn=ANOS+REBELDES&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"eletros","files":3,"time":1473383769,"description":"HALL THE MOVIE \nO cenário é o Rio de Janeiro da classe média e a trama segue o romance entre os jovens Maria Lúcia e João Alfredo, e a trajetória de um grupo de colegas do tradicional Colégio Pedro II, desde 1964, quando se formam e se instala no Brasil o violento regime de ditadura, até 1985, altura em que a política governamental terá já influenciado definitivamente os seus destinos.\nMaria Lúcia é uma jovem individualista, traumatizada com a história do pai, Orlando Damasceno, um jornalista conhecido e membro do Partido Comunista, que sempre colocou seus ideais acima da realização pessoal. Quando ela conhece João Alfredo, percebe que ele tem o mesmo perfil do pai e tem medo de se entregar à paixão. João, por sua vez, é um jovem de classe média extremamente preocupado com as questões sociais do país. Ao se apaixonar por Maria Lúcia, ele fica dividido entre o relacionamento afetivo e a militância política.\nO melhor amigo de João, Edgar, também se apaixona por Maria Lúcia e passa a disputar o amor da jovem com João Alfredo. Com o perfil oposto ao do amigo, Edgar não se envolve com as questões sociais do país, preferindo investir na profissão e na felicidade pessoal.\nApesar de se amarem, Maria Lúcia e João Alfredo vivem em conflito por causa da política e da ideologia de cada um. O namoro dos dois fica ainda mais difícil quando ele decide entrar para a luta armada. Após muitos encontros e desencontros, os dois acabam se separando definitivamente. Ela se casa com Edgar, e João, perseguido pela ditadura, é obrigado a sair do país.\nEntre os companheiros do movimento está Heloísa, filha do poderoso banqueiro Fábio Brito, que ajudou a financiar o golpe militar de 1964. De garota rica e mimada, Heloísa dá uma reviravolta em sua vida ao entrar para luta armada.\nO destino dos personagens está diretamente ligado ao momento político do país, que não atua, na minissérie, apenas como pano de fundo, como ocorreu com o período histórico da minissérie Anos Dourados, também de Gilberto Braga","torrent":{"xt":"urn:btih:df51c6b4e2f38d186d583b43620427e36fc871bf","amp;dn":"ANOS+REBELDES","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df51c6b4e2f38d186d583b43620427e36fc871bf","infoHashBuffer":{"type":"Buffer","data":[223,81,198,180,226,243,141,24,109,88,59,67,98,4,39,227,111,200,113,191]},"announce":[],"urlList":[]}}