{"title":"Sonic the Hedgehog The Movie (1996) (10bit x265 HEVC Dual Audio)","uid":15239800,"size":505899279,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ec94d24b73ecf7d25ce73dddfc4be905f1263c7e&amp;dn=Sonic+the+Hedgehog+The+Movie+%281996%29+%2810bit+x265+HEVC+Dual+Audio%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mikeycomicsinc","files":3,"time":1467929349,"description":"The Sonic the Hedgehog OVA was originally released as two episodes on VHS in 1996, and re-released as a single movie on DVD in 1999. The DVD was terrible: interlaced, telecined, desaturated, and the chapters didn't make sense. So I started this project with the goal of restoring the DVD to its original glory. This version does that as close as possible, and offers several new improvements over previous encodes.\r\n\r\nThe video track has been deinterlaced, restored the proper source framerate, cropped to remove pillarboxing, denoised, sharpened, and the colors brightened. The original display aspect ratio is preserved, so there is no picture distortion. Video is encoded with x265 HEVC 10-bit and is virtually lossless. The are 2 stereo audio tracks, Japanese and English, transparently encoded with FDK AAC-LC. The subtitle track is English with some translation and spelling corrections. The original DVD chapters have been replaced by a new set of chapters that are more coherent. The chapters are titled using a style similar to the OVA episode titles.\r\n\r\nAs a special bonus, I've included the opening and ending animations from the Sonic CD game. These animations were orignially created in 1993 by Toei Animation and Studio Junio for Sonic CD. The clips in the game itself are pixelated, but I came across a decent source of the original animations. I was able to improve them with cropping, noise removal, sharpening, color adjustments, and a corrected display aspect ratio. Both clips are dual audio with Japanese and US versions. The audio tracks were remastered and edited using the best sources available. The encoding for these clips is also x265 10bit and AAC","torrent":{"xt":"urn:btih:ec94d24b73ecf7d25ce73dddfc4be905f1263c7e","amp;dn":"Sonic+the+Hedgehog+The+Movie+%281996%29+%2810bit+x265+HEVC+Dual+Audio%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec94d24b73ecf7d25ce73dddfc4be905f1263c7e","infoHashBuffer":{"type":"Buffer","data":[236,148,210,75,115,236,247,210,92,231,61,221,252,75,233,5,241,38,60,126]},"announce":[],"urlList":[]}}