{"title":"[PARODY]Batgirl Rises","uid":15662395,"size":1262995839,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:f1972634adf17b84303c449d906a2b1fe007f8d6&amp;dn=%5BPARODY%5DBatgirl+Rises&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"hunter534","files":1,"time":1472186883,"description":"Part 1: Batgirl Rises\r\n\r\nBatgirl transforms into her secret identity when she finds out that she was given a new mission. The idea of being in charge of this top secret mission is really turning her on! Too worked up and too excited for the arrival of the Super Villainess. She decides to pleasure herself to calm down those nerves and get some needed release! all for a good cause, of course!\r\n\r\nWhen the super villainess – Vampirella is delivered to Batgirl secret hide out she is tied to a dolly. Vampirella has been captured and is about to be interrogated by batgirl. It seems, that the Vampire Queen was the last one to have seen Batman before his disappearance.. Batgirl will do what ever she needs to, to find out what happened to him. She will be using any means necessary to find out the truth.\r\n\r\nPart 2: Double Crossed\r\n\r\nCatwoman is in Istanbul meeting a potential buyer for some very classified military information. She is waiting for the buyer in a club. In a secluded section in the back. Suddenly a beautiful belly dancer comes to her booth and starts dancing erotically for her. Moving her hips and seducing her with her moves. Catwoman is very entertained by the gorgeous dancer and purrrring of admiration! She is so taken by her beauty that she does not realized that she is being robbed. Indeed, the beautiful dancer turns out to be Miss America on a secret mission to protect her nation! Once Catwoman realizes she has been fooled, she decided to double cross Miss America and make a fool of her too!Our Super heroine finds herself in quite a shameful bound position with Catwoman lapping her pussy… A secret mission like you have not seen before!\r\n\r\nPart 3: Frozen Bat\r\n\r\nBatgirl is alone at the Bat Cave. She receives a phone call. It’s Batman and Robin! They will be gone all night on a special mission. She is thrilled. It’s the first time they leave her alone and in charge! She feels proud and excited at the same time. She is ready and has already set on the security system. This way she will get alarmed if anyone tries to break in.\r\n\r\n\r\nGenre: Big Tits, Lesbian, Paradoy\r\nCast: Anastasia Pierce, Angela Sommers, Crystal Clark\r\n\r\nCOVER+SCEENSHOT:\r\n \nhttp://img-one.com/img-57bfac871e96c.html \r\n \nhttp://img-one.com/img-57bfad7899ae9.html","torrent":{"xt":"urn:btih:f1972634adf17b84303c449d906a2b1fe007f8d6","amp;dn":"%5BPARODY%5DBatgirl+Rises","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1972634adf17b84303c449d906a2b1fe007f8d6","infoHashBuffer":{"type":"Buffer","data":[241,151,38,52,173,241,123,132,48,60,68,157,144,106,43,31,224,7,248,214]},"announce":[],"urlList":[]}}