{"title":"Hannibal Brooks [1969]","uid":15253209,"size":4515082240,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:f1bf13f2f02d9c8b93dc2db632be16490d2428bc&amp;dn=Hannibal+Brooks+%5B1969%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"Spoofy007","files":1,"time":1468079946,"description":"Hinnibal Brooks [1969] DvD\r\n\r\nWorld War II - Action / Comedy\r\n\r\n\r\n\r\nAudio: English\r\n\r\nSubs: English / Korean\r\n\r\n\r\nRegion: ALL\r\n\r\n\r\nPacket Size = 8MB\r\n\r\nNumber of Packets = 539\r\n\r\n\r\n\r\nScreen Format = Wide Screen\r\n\r\n\r\nDvD Format = NTSC\r\n\r\n\r\n\r\nIn WW2, captured British soldier Stephen Brooks is on a prison train to Germany.On the train he meets an American prisoner, Packy, who's obsessed with escaping.Brooks tries to temper Packy and reminds him that escaped prisoners are shot if recaptured.Packy is insistent despite Brooks' warnings. On arrival at the POW camp Stalag 7A, Brooks and other fellow POWs are sent to work at the local Munich zoo, to care for the animals.Brooks is assigned to care for Lucy the elephant.The German caretaker in charge of Lucy is asked to train Brooks in his new job.At first, Brooks hates the assignment, considering the large amount of animal waste to be cleaned daily.However, he eventually becomes attached to Lucy the elephant.After a devastating bombing raid that kills some of the animals and zoo staff it is decided to evacuate the surviving animals.Lucy is scheduled to be transported by train to Innsbruck, Austria.On the departure day, the train is commandeered by a moody SS Colonel, for his troops.The colonel jokes that Brooks can walk the elephant all the way to Austria, if he wishes.The joke gives Brooks the idea of walking the elephant to Austria, with two armed guards and a Polish maid as cook.The Munich Zoo director, worried for Lucy's safety, agrees to evacuate her and send her to Austria on foot.Two soldiers provide the armed guard.One is Willy,a friendly Austrian soldier, and the other is Kurt,a brutal German soldier who gets drunk often, insults everyone and threatens to shoot the elephant.The group leaves Munich on a sunny day but the voyage to Austria isn't a promenade in the park when they start running into trouble.\r\n\r\n\r\n\r\n**********************************************************************************\r\n\r\n****-Note About DvD-**** \r\n\r\nNothing has been added nor taken away it is as I received it. If there are no subs in your required language it is because there were none on the DvD and I was unable to procure a DvD with those Subs.\r\n\r\n\r\n\r\nIngenting har lagts till eller tagits bort är det som jag fick den. Om det inte finns några subs i ditt önskat språk är det för att det fanns ingen på DVD och jag kunde inte skaffa en DVD med dessa Subs\r\n\r\n\r\n\r\nNiets is toegevoegd of weggenomen is als ik hem ontving. Als er geen subs in uw gewenste taal is het omdat er geen waren op de DVD en ik was niet in staat om een ​​DVD te kopen met die Subs.\r\n\r\n*********************************************************************************\r\n\r\n\r\n\r\n***** As Always, My Thanks in advance go to those who stay on to seed after their download has been completed it is much appreciated *****\r\n\r\n\r\n\r\n     \nhttp://www.imdb.com/title/tt0064403","torrent":{"xt":"urn:btih:f1bf13f2f02d9c8b93dc2db632be16490d2428bc","amp;dn":"Hannibal+Brooks+%5B1969%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1bf13f2f02d9c8b93dc2db632be16490d2428bc","infoHashBuffer":{"type":"Buffer","data":[241,191,19,242,240,45,156,139,147,220,45,182,50,190,22,73,13,36,40,188]},"announce":[],"urlList":[]}}