{"title":"Treasure Island (1938) Russian with Eng Subs","uid":15537224,"size":688435664,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f5da405dfc8cce4a56ade023563d4999eb502d38&amp;dn=Treasure+Island+%281938%29+Russian+with+Eng+Subs&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"flaming100","files":1,"time":1470887777,"description":"This Russian-made film on Stevenson’s Treasure Island came out in Russia in the midst of the Communist repressions in the late 1930s.  Still widely known in Russia for its unique portrayal of Robert Louis Stevenson’s classic.  Good people (Livesey, Hawkins, Smollett, others) seek treasure not for themselves but to help the working class, while bad people (the pirates) are the selfish ones.  The pirates sometimes quote from the Bible, but never the good guys.   The treasure is sought by the good guys to buy arms for the Irish Rebellion.  Though most of the film follows Stevenson’s book, there are certain differences besides the motivation of the good guys.  The Benbow Inn is on the coast of Ireland and the ship sails out of Dublin.  Young Hawkins is Jenny Hawkins who signs on the ship as cabin boy Jim.  The pirate bad guys being not terribly bright do not discover that the young and cute cabin boy is a girl.  Pirates sing and dance.  The film is intentionally funny in some places and being so old is unintentionally funny in others.  Out for nearly 80 years there were no subtitles in English until very recently someone came up with them.  This is the original version, and what a few years ago came out domestically in Russia on DVD is somewhat edited, inferior and still without subtitles.\r\n\r\n1 hour 27 minutes, b&amp;w\r\n657 MB, Xvid, MP3, 512x384, a TVRip with English subtitles added as hardsubs","torrent":{"xt":"urn:btih:f5da405dfc8cce4a56ade023563d4999eb502d38","amp;dn":"Treasure+Island+%281938%29+Russian+with+Eng+Subs","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5da405dfc8cce4a56ade023563d4999eb502d38","infoHashBuffer":{"type":"Buffer","data":[245,218,64,93,252,140,206,74,86,173,224,35,86,61,73,153,235,80,45,56]},"announce":[],"urlList":[]}}