{"title":"Daddies and Piss Boys [2015 , DVDRip]","uid":15480410,"size":2574337838,"categoryP":"porn","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:f7855a975186c79b4bbb646b9c2693cef0e5dfa3&amp;dn=Daddies+and+Piss+Boys+%5B2015+%2C+DVDRip%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SudoSu","files":1,"time":1470244637,"description":"http://youpornbook.com\r\n\r\n-------------------------\r\n ... : Screenshots : ... \r\n-------------------------\r\n \nhttp://imagep2p.com/?g=742887 \nhttp://imagep2p.com/?v=565945\r\n\r\n-------------------------\r\n ... : Description : ... \r\n-------------------------\r\n\r\nProduction year: 2015\r\nCountry: USA\r\nGenre: Group sex, Orgy, Hairy, Bears, Pissing, Golden Shower, Leather, Oral, Rimming, Anal, Bareback, Dildo, Fisting, Cum\r\nDuration: 2:09:06\r\n\r\nDirector: Dick Wadd\r\nStudio: A DickWadd Media Production\r\n\r\nStarring: Shay Michaels, Ray Dalton, Nick Roberts, Aarin Asker, Lukas Cipriani, Lex Antoine\r\n\r\nDescription: Three hot, hung, leather daddies are out to train their three new piss boys. The boys get taught how to drink piss from hard fucking cocks. They take fists and large dildos up their hungry holes. Then the Daddies and cum deep inside their Boys' guts.\r\n\r\nExtras. Information: Aarin Asker is sitting in his tub dreaming of drinking piss from some hot muscle men. Holy crap his dream comes true and he gets piss from every direction. Drinking it up as fast as it comes at him. Six little piggies in the Dick Wadd glory hole makes for some hot action. Lukas Cipriani is getting his cock sucked by Aarin when a huge dick comes through the glory hole. Soon another cock comes through the other glory hole and it starts pissing all over both Aarin and Lukas. The two pigs swallow every drop. Shay Michaels steps in and takes a huge leak on Nick Roberts' boots. Aarin gets on his knees and cleans those boots with his tongue, being sure to get Nick's boots perfectly clean. After the men have emptied their bladders, it's time to start fucking. Nick uses his big cock to fuck Lukas through the glory hole while Aarin services the other guys' cocks with his mouth. Nick plows a load into Lukas 'tight hole and Ray Dalton is more than eager to lick up the cum dripping from Lukas' well used hole. Aarin and Lukas are taking turns drinking piss while sitting in the piss tub. This gets the rest of the pigs amped up and wanting more. They turn their attention and cocks to Lex Antoine's furry ass. Ray, Nick, Shay and Lukas all take their turn fucking Lex. Ray gets the final fuck and dumps his nut deep inside Lex. Aarin is a happy little piss pig, just sitting in the tub taking piss from 5 hot men. When the piss runs out, it's time for some hardcore ass stretching. Ray Dalton is one sly daddy. He's in the mood to collect some hot loads, so he recruits some o 'the hottest men and boys this side o' the Mississippi to lay him out and load him up.\r\n\r\nVideo Quality: DVDRip\r\nVideo Format: MP4\r\nVideo: MPEG4 Video (H264) 960x540 29.97fps 2500kbps\r\nAudio: AAC 44100Hz stereo 152kbps\r\n\r\nMore exclusive porn at:  https://thepiratebay.se/user/SudoSu/","torrent":{"xt":"urn:btih:f7855a975186c79b4bbb646b9c2693cef0e5dfa3","amp;dn":"Daddies+and+Piss+Boys+%5B2015+%2C+DVDRip%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7855a975186c79b4bbb646b9c2693cef0e5dfa3","infoHashBuffer":{"type":"Buffer","data":[247,133,90,151,81,134,199,155,75,187,100,107,156,38,147,206,240,229,223,163]},"announce":[],"urlList":[]}}