{"title":"Active Coatings for Smart Textiles - Jinlian Hu","uid":15473382,"size":42567133,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fa2d8105431ffcf22ed4d6b7a7ecd570ced8d100&amp;dn=Active+Coatings+for+Smart+Textiles+-+Jinlian+Hu&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clouderone","files":1,"time":1470161733,"description":"Active Coatings for Smart Textiles - Jinlian Hu (WP, 2016).pdf\r\n\r\nActive Coatings for Smart Textiles presents the latest information on active materials and their application to textiles in the form of coatings and finishes for the purpose of improving performance and creating active functional effects. This important book provides detailed coverage of smart coating types, processes, and applications.\r\n\r\nAfter an introduction to the topic, Part One introduces various types of smart and active coatings, including memory polymer coatings, durable and self-cleaning coatings, and breathable coatings. Technologies and related processes for the application of coatings to textiles is the focus of Part Two, with chapters devoted to microencapsulation technology, plasma surface treatments, and nanotechnology-based treatments.\r\n\r\nThe book ends with a section on applications of smart textiles with responsive coatings, which are increasingly finding commercial niches in sportswear, protective clothing, medical textiles, and architecture.\r\n\r\n\r\n\r\nIntroduces various types of smart and active coatings for textiles\r\nCovers technologies and application processes for the coating and finishing of textiles\r\nReviews commercial applications of such coatings, including in sportswear, protective clothing, medical textiles and architecture","torrent":{"xt":"urn:btih:fa2d8105431ffcf22ed4d6b7a7ecd570ced8d100","amp;dn":"Active+Coatings+for+Smart+Textiles+-+Jinlian+Hu","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa2d8105431ffcf22ed4d6b7a7ecd570ced8d100","infoHashBuffer":{"type":"Buffer","data":[250,45,129,5,67,31,252,242,46,212,214,183,167,236,213,112,206,216,209,0]},"announce":[],"urlList":[]}}