{"title":"Viva Max","uid":15566479,"size":1442660756,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fd6b61c0409b8b802e1d64f3d308e7ec29881ea6&amp;dn=Viva+Max&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Psychodad149","files":2,"time":1471206134,"description":"VIVA MAX!\r\n\r\n1969\r\n\r\nMarvelous comedy, almost forgotten and little regarded. A remarkable cast too: Peter Ustinov, a screen legend, perhaps best known for his roles as the Emperor Nero in the Biblical epic Quo Vadis? and Hercule Poirot in several movies, here plays General Maximilian Rodrigues de Santos, a Mexican general obsessed with re-taking the Alamo. His second-in-command is Sgt. Valdez, John Astin of Addams Family fame. Other luminaries include the legendary Jonathan Winters as General Billy Joe Hallson of the Texas National Guard, whose military career never included any action which didn't involve changing light bulbs; Keenan Wynn as General Lacomber, regular Army tasked with taking the Alamo back from General de Santos (Wynn may be best remembered as Col. &quot;Bat&quot; Guano in &quot;Dr. Strangelove&quot;); Harry Morgan (Col. Potter, Joe Gannon) as Police Chief Sylvester; Kenneth Mars as Sam Gillison, leader of a local patriot militia (Mars is probably best known from &quot;The Producers&quot; as the German ex-soldier who wrote the original script of &quot;Springtime For Hitler&quot;); character actress Alice Ghostley; and co-starred popular blond bombshell of the era, Pamela Tiffin.\r\n\r\nOverall, Viva Max! is a broad military-political spoof as Gen. de Santos actually does re-occupy the Alamo, storming the gates moments before closing time, triggering a very minor international incident while holding two women (Tiffin &amp; Ghostley) hostage, and demanding rather pompously to be put in touch with the Pentagon.\r\n\r\nHis plans for occupation receive their first setback when Sgt. Valdez informs him that none of the soldiers have ammunition: they entered the US under the pretext of marching in the Washington's Birthday Parade in Laredo, and even Valdez was under this impression. The extent of Santos' firepower is the revolver loaded with six rounds which they confiscated from Police Chief Sylvester at the beginning of their invasion. \r\n\r\nThe General assembles his men and finally addresses them with a grand speech, informing them that the &quot;Nord-Americanos&quot; have atomic bombs, &quot;hee-dro-hen&quot; bombs, flamethrowers, secret weapons, etc. etc. &quot;What  do we have? Six bullets!&quot; He then makes them the same offer Col. Travis made to the original defenders of the Alamo, drawing a line in the sand and inviting anyone who did not want to stand and fight with him to step over it and run: with rather startling results! \r\n\r\nTexas National Guard troops finally scale the walls. Because General Lacomber wanted to be sure there was no bloodshed, HIS orders were -- that the troops carry no ammo! A climactic standoff ensuses as the two armies face each other unflinchingly -- and effectively unarmed -- except for those six bullets . . . \r\n\r\nThis is a very funny movie. It was somewhat controversial even in its day, with Mexicans unhappy about the portrayal of their armed forces, and Texans unhappy about the very premise of the Alamo being retaken! It would likely draw more ire today for the fact that two of the leads wear dark makeup and speak with Mexican accents. So this is not a movie for the easily offended (also, Alice Ghostley's character is under the impression the whole thing is being staged by the Red Chinese, and calls her captor a &quot;pink Chink.&quot;) But if you can waive some of those sensibilities and just enjoy a good laugh -- and appreciate the flavor of the '60s -- you might love this movie.\r\n===\r\n\r\nThis movie does not seem to be available in the US as either video or DVD. This offering was ripped from a Region 2 DVD produced in Spain and the original carried both Spanish and English soundtracks; this is the original English-language soundtrack only","torrent":{"xt":"urn:btih:fd6b61c0409b8b802e1d64f3d308e7ec29881ea6","amp;dn":"Viva+Max","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd6b61c0409b8b802e1d64f3d308e7ec29881ea6","infoHashBuffer":{"type":"Buffer","data":[253,107,97,192,64,155,139,128,46,29,100,243,211,8,231,236,41,136,30,166]},"announce":[],"urlList":[]}}